[
  {
    "id": "1",
    "name": "Popkit",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Sneerkit",
        "Level",
        "18"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Energetic and endlessly optimistic, Popkit barrels into situations like a fuzzy cannonball. Its metal drum harness amplifies its barks into sonic booms.",
    "frontKeywords": "fluffy orange fox, metal barrel armor, big ears, raised fists, energetic grin",
    "backKeywords": "fox in barrel back view, orange tail, stubby legs, metallic drum body",
    "image": "Popkit.png"
  },
  {
    "id": "2",
    "name": "Sneerkit",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Always scheming, this smug little cub causes mischief wherever it roams, daring any who challenge it.",
    "frontKeywords": "smirking cub, red eyes, scruffy fur, mischievous grin, sharp eyebrows",
    "backKeywords": "raised tail, hunched pose, fuzzy outline, challenging posture, feline prankster",
    "image": "Sneerkit.png"
  },
  {
    "id": "3",
    "name": "Spindash",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "0.8",
    "pokedex": "Always on the move, this spiky critter rolls into a ball to zoom through forests and fields, leaving behind trails of scattered leaves.",
    "frontKeywords": "dark green hedgehog, sharp quills, big eyes, rounded belly, grassy ground",
    "backKeywords": "quill-covered back, low stance, curled-up outline, green blur",
    "image": "Spindash.png"
  },
  {
    "id": "4",
    "name": "Candlepurr",
    "oldName": "Candlewhisk",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1",
    "pokedex": "Candlepurr is a sacred feline that lights dark shrines with the flames it holds. It never burns what it loves, and its warm glow comforts the fearful.",
    "frontKeywords": "white cat, candle flames, symmetrical paws, red cape, glowing wicks, cute eyes, sacred expression, shrine companion",
    "backKeywords": "cloak trailing behind, candle holders visible, fluffy back silhouette, seated stance, tail under cloak",
    "image": "Candlepurr.png"
  },
  {
    "id": "5",
    "name": "Badger",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Leafcub",
        "Item",
        "Leafstone"
      ],
      [
        "Ripplash",
        "Item",
        "Waterstone"
      ],
      [
        "Flarehound",
        "Item",
        "Firestone"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "Badger is a sprightly forest companion with a heart full of joy. Always sniffing for herbs and berries, it carries the blessing of woodland spirits. The flower tucked on its head is said to bloom only for creatures pure of heart.",
    "frontKeywords": "cute forest pup, brown fur, flower crown, wide eyes, wagging tongue, round body, cartoon style, sitting pose, fluffy cheeks",
    "backKeywords": "round tail, flower visible from above, floppy ears turned slightly back, back fur darker, seated posture, small back paws",
    "image": "Badger.png"
  },
  {
    "id": "6",
    "name": "Leafcub",
    "oldName": "Verdawuff",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Cheerful and brave, Leafcub guards the forest floor. It trains by play-fighting with falling leaves and glowing bugs.",
    "frontKeywords": "bear cub, leafy collar, white stripe, big eyes",
    "backKeywords": "bushy tail, forest feet, rounded ears",
    "image": "Leafcub.png"
  },
  {
    "id": "7",
    "name": "Ripplash",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "This playful creature splashes through shallow waters with a carefree grin, using its inflatable body to bounce off danger.",
    "frontKeywords": "blue aquatic dragon, ring-shaped body, playful face, small fins",
    "backKeywords": "tail inside ring, curled posture, water toy texture, glossy sheen",
    "image": "Ripplash.png"
  },
  {
    "id": "8",
    "name": "Flarehound",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Flarehound is a loyal ember beast born from volcanic plains. It channels searing heat through its mane and hunts in molten silence.",
    "frontKeywords": "orange wolf, dark muzzle, fiery eyes, fluffy tail, proud stance, glowing underbelly",
    "backKeywords": "large tail fluff, ember glow lines, sleek back fur, pointed ears, muscular limbs",
    "image": "Flarehound.png"
  },
  {
    "id": "9",
    "name": "Flutterbean",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [
      [
        "Beeatrice",
        "Level",
        "16"
      ]
    ],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "0.7",
    "pokedex": "Flutterbean is a spritely critter of garden paths. With each wingbeat, it spreads pollen and mischief alike.",
    "frontKeywords": "pink caterpillar, fairy wings, curly antenna, big eyes, striped body, flower sprite",
    "backKeywords": "gossamer wings, curled pink tail, back ridges, fairy trail, pudgy back",
    "image": "Flutterbean.png"
  },
  {
    "id": "10",
    "name": "Beeatrice",
    "oldName": "Regalume",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1",
    "pokedex": "Beeatrice is an elegant insectoid queen known for her graceful movements and commanding presence. With wings like stained glass and an armored gown, she glides through the air as a guardian of balance in floral realms.",
    "frontKeywords": "bee queen, insect wings, petal gown, pink and black outfit, feminine bug creature, regal pose, segmented limbs, confident stance, graceful flyer",
    "backKeywords": "translucent wings from behind, wide petal skirt, sleek torso, twin antennae, wing veins visible, insect back plating",
    "image": "Beeatrice.png"
  },
  {
    "id": "11",
    "name": "Zephyra",
    "oldName": "",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1",
    "pokedex": "A nimble feline that dashes with the wind, its sleek form and fierce eyes make it a guardian of forest clearings.",
    "frontKeywords": "striped white cat, black zebra pattern, sharp orange eyes, fluffy tail",
    "backKeywords": "alert stance, smooth fur, curled tail, elegant poise",
    "image": "Zephyra.png"
  },
  {
    "id": "12",
    "name": "Trumple",
    "oldName": "Brassaboom",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1.3",
    "pokedex": "Each step from this brass-beaked beast blasts a booming tune—beloved by parade troupes and sonic battlers alike.",
    "frontKeywords": "blue elephant, brass trumpet nose, round ears, musical creature",
    "backKeywords": "standing upright, trumpet tail raised, sound burst visual, playful blush",
    "image": "Trumple.png"
  },
  {
    "id": "13",
    "name": "Cactusk",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "0.8",
    "pokedex": "Cactusk is a sleepy feline who’s fused with a cactus pod. Its flowers bloom when it dreams, and its spikes shoot when threatened.",
    "frontKeywords": "black cat, green cactus back, orange flowers, sleepy expression, red markings, protective thorns, desert hybrid",
    "backKeywords": "large cactus dome, hidden tail, flower blooms from back, cat ears poking out, sleepy pose, thorny surface",
    "image": "Cactusk.png"
  },
  {
    "id": "14",
    "name": "Nyxent",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "Draped in a starless cloak, Nyxent emerges on moonless nights to ferry lost souls and whisper forgotten dreams in a voice of silence.",
    "frontKeywords": "shadowy figure, starry cloak, mask face, floating ghost, cosmic being, spectral presence",
    "backKeywords": "star cloak from behind, ghostly drift, empty hood, space-themed spirit, floating shadow",
    "image": "Nyxent.png"
  },
  {
    "id": "15",
    "name": "Shelltorch",
    "oldName": "Pyroclix",
    "types": "Fire",
    "evolutions": [],
    "moves": "firespin,leer,metalclaw,ancientpower",
    "size": "1",
    "pokedex": "This fiery tortoise channels steam through brass exhausts on its shell, fueling short bursts of speed and power.",
    "frontKeywords": "fire tortoise, brass exhaust vents, glowing lava cracks, steampunk turtle, determined face",
    "backKeywords": "lava shell, steam vents, flame tail, mechanical shell plates, low stance",
    "image": "Shelltorch.png"
  },
  {
    "id": "16",
    "name": "Solkit",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Leofrond",
        "Level",
        "30"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "A playful and radiant kitten that radiates sunlight, often seen chasing sunbeams and curling up in patches of light.",
    "frontKeywords": "golden feline, blue eyes, perky ears, spiky mane, fluffy tail",
    "backKeywords": "tufted back, curled tail, sun-kissed fur, crouched pose",
    "image": "Solkit.png"
  },
  {
    "id": "17",
    "name": "Leofrond",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1.2",
    "pokedex": "Regal and fierce, this lion roars to mark its territory, its banana-like mane a source of jungle pride.",
    "frontKeywords": "banana mane, roaring lion, fierce eyes, leaf tail",
    "backKeywords": "leafy tail from behind, powerful stance, rounded mane tips",
    "image": "Leofrond.png"
  },
  {
    "id": "18",
    "name": "Strumbleaf",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "A musical forest dweller, its joyful strumming brings rain and bloom to nearby plants and listeners alike.",
    "frontKeywords": "leaf-winged creature, banjo, red gloves, wide smile, forest background",
    "backKeywords": "standing upright, strumming banjo, leaf antenna, expressive pose",
    "image": "Strumbleaf.png"
  },
  {
    "id": "19",
    "name": "Driftrella",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "0.8",
    "pokedex": "This jellyfish-like fairy floats through coral groves, spreading bioluminescent charm. Its parasol shell protects it from sun and storm, and many sailors whisper of it guiding lost ships back to shore with its glow.",
    "frontKeywords": "jellyfish, parasol cap, blue body, pink tendrils, glowing eyes, sea creature, floating, round form, pastel tones, aquatic fairy",
    "backKeywords": "underside of parasol, trailing tentacles, small round body, floating posture, jellyfish bell, glistening back",
    "image": "Driftrella.png"
  },
  {
    "id": "20",
    "name": "Fauxfire",
    "oldName": "Kindlark",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Though it looks cunning, Fauxfire is more mischief than malice. This crafty fox uses bursts of flame to distract enemies while it makes off with shiny treasures.",
    "frontKeywords": "orange fox, black paws, white chest, clever grin, fluffy tail, large ears, confident pose, cartoonish style, bright coloring",
    "backKeywords": "curled fluffy tail, upright ears, fox back legs, orange fur, small back claws, dynamic posture",
    "image": "Fauxfire.png"
  },
  {
    "id": "21",
    "name": "Bagheera",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "A phantom of the twilight forest, Bagheera stalks the night with glowing lantern eyes and a razor smile. It lures the unwary with its eerie lamp before striking from the shadows. Though feared, it is also respected as a guardian against true evil.",
    "frontKeywords": "dark feline, glowing yellow eyes, creepy smile, lantern tail, night stalker, spectral design, sharp teeth, shadow panther",
    "backKeywords": "lamp glowing behind tail, arched back, sleek fur, bushy tail with hook shape, rear legs crouched, predator stance",
    "image": "Bagheera.png"
  },
  {
    "id": "22",
    "name": "Mechleaf",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "tackle,harden,metalclaw,pinmissile",
    "size": "1",
    "pokedex": "Crafted by druids of old, Mechleaf is a blend of vine and gear, tirelessly tending to forest glades with robotic precision and a gentle soul.",
    "frontKeywords": "leaf robot, green plating, plant wings, vine arms, yellow eyes, forest guardian, mechanical creature",
    "backKeywords": "leafy wings from back, green shell, vines trailing, mossy back view, forest mech",
    "image": "Mechleaf.png"
  },
  {
    "id": "23",
    "name": "Chillaxodon",
    "oldName": "",
    "types": "Ice",
    "evolutions": [],
    "moves": "powdersnow,astonish,leer,doubleteam",
    "size": "1.2",
    "pokedex": "Chillaxodon is a frosty elephant who prefers naps over battles. With a popsicle tail and ice-dome head, it cools everything nearby with its sleepy aura.",
    "frontKeywords": "lazy ice elephant, popsicle tail, igloo head, droopy eyes, blue body, sleepy posture, cold aura, chubby limbs",
    "backKeywords": "rounded icy back, smooth dome, melting trail, tail popsicle exposed, droopy trunk resting",
    "image": "Chillaxodon.png"
  },
  {
    "id": "24",
    "name": "Zoggo",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "A loud, lovable beast known for its booming laugh and boundless energy, it startles foes more with its volume than its bite.",
    "frontKeywords": "blue furry monster, purple accents, wide mouth, small horns",
    "backKeywords": "open-mouthed grin, waving arm, wild tufted hair, big feet",
    "image": "Zoggo.png"
  },
  {
    "id": "25",
    "name": "Floffle",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [
      [
        "Whispuff",
        "Level",
        "16"
      ]
    ],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "0.8",
    "pokedex": "Floffle is a cloud-like critter that floats from flower to flower, its antennae vibrating with joy at even the gentlest breeze.",
    "frontKeywords": "white puff creature, spiral antennae, pink cheeks, tiny wings, curly tail, cute expression",
    "backKeywords": "round fuzzy back, fluttering wings, bouncy shape, floating form, soft blush hue",
    "image": "Floffle.png"
  },
  {
    "id": "26",
    "name": "Whispuff",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [
      [
        "Seraphluff",
        "Level",
        "32"
      ],
      [
        "Glacilamb",
        "Item",
        "Waterstone"
      ],
      [
        "Cinderlamb",
        "Item",
        "Firestone"
      ],
      [
        "Mosslamb",
        "Item",
        "Leafstone"
      ]
    ],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1",
    "pokedex": "This bubbly woolen sprite drifts gently on the breeze, trailing a faint scent of candyfloss and dreams.",
    "frontKeywords": "pink puffball, sheep wings, antenna orbs, soft wool",
    "backKeywords": "hovering midair, cheerful face, fluff swirl, pastel tones",
    "image": "Whispuff.png"
  },
  {
    "id": "27",
    "name": "Seraphluff",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1",
    "pokedex": "Legends say this fluffy being brings peace to those it touches, its wings brushing away sorrow with every beat.",
    "frontKeywords": "angelic lamb, pink tufts, fluffy wings, heart eyes",
    "backKeywords": "curly wool, ribbon tail, pastel swirl fur, winged pose",
    "image": "Seraphluff.png"
  },
  {
    "id": "28",
    "name": "Puffetti",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Born from leftover party magic, Puffetti lives to celebrate. Its hat never falls off, even in flight, and it leaves trails of confetti when happy.",
    "frontKeywords": "yellow balloon creature, green and yellow party hat, blue spots, blushing cheeks, happy eyes",
    "backKeywords": "round party creature back view, fin tail, party hat, small feet",
    "image": "Puffetti.png"
  },
  {
    "id": "29",
    "name": "Spiribun",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [
      [
        "Flufflare",
        "Level",
        "38"
      ]
    ],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1",
    "pokedex": "Said to be messengers from the spirit realm, these rabbit-like beings are seen only in times of great harmony.",
    "frontKeywords": "soft pink fur, violet spiral markings, feathered wings, large ears, wide eyes",
    "backKeywords": "fluffy wings, spiral tail, seated pose, ethereal shimmer",
    "image": "Spiribun.png"
  },
  {
    "id": "30",
    "name": "Flufflare",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1",
    "pokedex": "Flufflare is a fox of radiant delight, its flames never burn but instead warm the hearts of those nearby.",
    "frontKeywords": "fluffy fox, yellow fur, pink eyes, ember tails, star forehead, cheerful glow",
    "backKeywords": "twin ember tails, soft back fur, light spark effects, rounded ears, plush outline",
    "image": "Flufflare.png"
  },
  {
    "id": "31",
    "name": "Spriggup",
    "oldName": "",
    "types": "Water,Grass",
    "evolutions": [],
    "moves": "astonish,growl,absorb,watergun",
    "size": "0.8",
    "pokedex": "A plucky starter creature that’s always ready for adventure, brimming with enthusiasm and verdant energy.",
    "frontKeywords": "green lizard, cream belly, clenched fist, wide smile, confident stance",
    "backKeywords": "long tail, leaf-shaped crest, back arched, dynamic pose",
    "image": "Spriggup.png"
  },
  {
    "id": "32",
    "name": "Leafmealone",
    "oldName": "Umbraspout",
    "types": "Grass",
    "evolutions": [
      [
        "Leafluv",
        "Level",
        "12"
      ]
    ],
    "moves": "absorb,bind,stunspore,growth",
    "size": "0.7",
    "pokedex": "Grumpy and withdrawn, this leafy spirit hides within layers of cabbage, glaring at intruders with golden eyes.",
    "frontKeywords": "angry cabbage-like creature, dense green leaves, glowing yellow eyes, squat form",
    "backKeywords": "layered leafy back, squat stance, tucked limbs, green tones",
    "image": "Leafmealone.png"
  },
  {
    "id": "33",
    "name": "Leafluv",
    "oldName": "Rollherb",
    "types": "Grass",
    "evolutions": [
      [
        "Topbloom",
        "Level",
        "24"
      ]
    ],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "This cheerful critter loves lounging in sunny patches, its leafy fluff rustling happily in the breeze.",
    "frontKeywords": "round leafy creature, wooden wheelbarrow, cheerful smile, grassy setting",
    "backKeywords": "leafy back, wheelbarrow from behind, small shadow, grass base",
    "image": "Leafluv.png"
  },
  {
    "id": "34",
    "name": "Topbloom",
    "oldName": "Floravale",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "A joyful spirit of the glade, always welcoming spring with floral dances and leafy twirls beneath its wide-brimmed hat.",
    "frontKeywords": "plant fairy, green leafy dress, sun hat, yellow flower collar",
    "backKeywords": "open arms, spinning motion, round petal skirt, vibrant leaf wings",
    "image": "Topbloom.png"
  },
  {
    "id": "35",
    "name": "Brutalon",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1.3",
    "pokedex": "Brutalon is a raging beast of myth, feared for its uncontrollable fury. Its roar echoes through mountains, and it charges with terrifying speed. Ancient ruins often bear its claw marks.",
    "frontKeywords": "alpha werebeast, orange fur, snarling mouth, bulging muscles, long claws, standing upright, rage-filled face, primal predator",
    "backKeywords": "thick furry back, raised arms, clawed fingers, tail low, wide leg stance, power-forward back posture",
    "image": "Brutalon.png"
  },
  {
    "id": "36",
    "name": "Nautublub",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1.3",
    "pokedex": "This colossal sea creature drifts through kelp forests, its back overgrown with algae. Sailors whisper of its songs echoing through the deep.",
    "frontKeywords": "giant whale, algae-covered back, sleepy eyes, seaweed beard, ancient marine beast",
    "backKeywords": "whale back view, green-covered tail, algae strands, ocean giant silhouette, peaceful rear",
    "image": "Nautublub.png"
  },
  {
    "id": "37",
    "name": "Penguinja",
    "oldName": "",
    "types": "Ice",
    "evolutions": [],
    "moves": "powdersnow,astonish,leer,doubleteam",
    "size": "0.9",
    "pokedex": "A stealthy waddler trained in the arts of icy ninjutsu, its stars strike with the chill of winter night.",
    "frontKeywords": "penguin ninja, red sash, shuriken pose, beady eyes",
    "backKeywords": "wrapped feet, symbol hat, stance wide, icy weapons",
    "image": "Penguinja.png"
  },
  {
    "id": "38",
    "name": "Fumudge",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "Fumudge is a volatile creature formed of burnt matter and noxious fumes. Despite its foul appearance, it has explosive bursts of energy.",
    "frontKeywords": "angry soot blob, smog cloud, smoking swirl head, fiery mouth",
    "backKeywords": "curled tail of smoke, bubbling back texture, sulfurous haze",
    "image": "Fumudge.png"
  },
  {
    "id": "39",
    "name": "Thinkit",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Brainiog",
        "Level",
        "28"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "A curious primate known for solving puzzles faster than it snacks—often seen adjusting its glasses before a breakthrough.",
    "frontKeywords": "brown monkey, blue glasses, fluffy fur, large ears, thinking pose",
    "backKeywords": "sitting posture, tilted head, bright eyes, curled tail tip",
    "image": "Thinkit.png"
  },
  {
    "id": "40",
    "name": "Brainiog",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1.2",
    "pokedex": "Brainiog is a primal ape with unmatched strength and ancient instincts. Wielding a massive club made from petrified wood, it dominates forest battles with raw power and territorial roars.",
    "frontKeywords": "gorilla warrior, dark green fur, wooden club, muscular arms, bare chest, fierce expression, jungle guardian, prehistoric style, combat stance",
    "backKeywords": "broad hairy back, club slung behind, hunched posture, long arms, large feet, bristled fur",
    "image": "Brainiog.png"
  },
  {
    "id": "41",
    "name": "Moosquito",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1.1",
    "pokedex": "This bizarre hybrid thrives in the darkest woods, where its wings buzz with menace and its tongue lashes like a whip.",
    "frontKeywords": "moose mosquito hybrid, black fur, red eyes, orange wings, long tongue, strange creature",
    "backKeywords": "insect wings from back, moose body silhouette, buzzing pose, strange hybrid rear view",
    "image": "Moosquito.png"
  },
  {
    "id": "42",
    "name": "Hootspring",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "chargebeam,metalclaw,bulldoze,ancientpower",
    "size": "1",
    "pokedex": "A wise old creature whose body is entwined with the essence of time itself. The clock embedded in its chest ticks only in moonlight.",
    "frontKeywords": "owl, clock chest, leafy feathers, intense stare",
    "backKeywords": "bushy tail, clock gears, curved talons",
    "image": "Hootspring.png"
  },
  {
    "id": "43",
    "name": "Gearaffe",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "chargebeam,metalclaw,bulldoze,ancientpower",
    "size": "1.5",
    "pokedex": "An automaton built by a lost civilization, Gearaffe marches with mechanical grace. Its gears never stop turning.",
    "frontKeywords": "brass giraffe, segmented neck, gear joints, steampunk design",
    "backKeywords": "cogwheel legs, metallic spine, winding key tail",
    "image": "Gearaffe.png"
  },
  {
    "id": "44",
    "name": "Paintdoodle",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "This vibrant creature expresses itself through color, its fur shifting hues with its mood and creative energy.",
    "frontKeywords": "rainbow poodle, curly fur, confident stance, fluffy tail",
    "backKeywords": "rainbow gradients, flowing coat, alert pose, soft paws",
    "image": "Paintdoodle.png"
  },
  {
    "id": "45",
    "name": "Roscorpion",
    "oldName": "",
    "types": "Ground,Grass",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "Its petals conceal venomous thorns, making it a deceptive beauty in the wilderness—admired, but not to be touched.",
    "frontKeywords": "red scorpion, rose bloom, thorned legs, leafy segments",
    "backKeywords": "rose petals opened, stinger arched, segmented tail, green leaves",
    "image": "Roscorpion.png"
  },
  {
    "id": "46",
    "name": "Falcarve",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Falcarve is a fierce sky warrior, known to strike like lightning and disappear into the clouds. Its talons leave marks like carved stone, hence its name among highland tribes.",
    "frontKeywords": "white eagle, sharp eyes, spread wings, yellow beak, grey crest, talons ready, flying pose, fierce predator, sleek feathers",
    "backKeywords": "broad white wings, curved tail feathers, back muscles, grey crest from behind, airborne motion",
    "image": "Falcarve.png"
  },
  {
    "id": "47",
    "name": "Snaproot",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1.2",
    "pokedex": "With jaws like a bear trap and roots for limbs, it lies in wait beneath the forest canopy for intruders.",
    "frontKeywords": "carnivorous plant, red flower maw, gnarled wood limbs, leafy skirt, open jaws",
    "backKeywords": "twisted trunk, vines and leaves, blooming flower trap, hidden eyes, root stance",
    "image": "Snaproot.png"
  },
  {
    "id": "48",
    "name": "Llampurr",
    "oldName": "Nimblume",
    "types": "Mythic,Dark",
    "evolutions": [
      [
        "Zapaca",
        "Level",
        "40"
      ]
    ],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "0.9",
    "pokedex": "Covered in stormy wool, it charges up electricity as it trots through thunderclouds.",
    "frontKeywords": "cloud puff creature, lightning streaks, purple fluff, curly tail",
    "backKeywords": "dark cloud wool, electric swirls, determined stance",
    "image": "Llampurr.png"
  },
  {
    "id": "49",
    "name": "Zapaca",
    "oldName": "Velumora",
    "types": "Mythic,Dark",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1.1",
    "pokedex": "Its fluffy coat crackles with static, storing energy from each buzz and zap it hears.",
    "frontKeywords": "electric bee-fox, yellow fur, black ear tips, puffy cheeks",
    "backKeywords": "agitated expression, paws lifted, wings angled back, spiked fur",
    "image": "Zapaca.png"
  },
  {
    "id": "50",
    "name": "Dapperink",
    "oldName": "",
    "types": "Normal,Water",
    "evolutions": [],
    "moves": "watergun,aquajet,tackle,growl",
    "size": "1",
    "pokedex": "A posh little creature with impeccable manners, Dapperink always arrives dressed to impress. Donning a formal tuxedo and monocle-topped hat, it uses its tail to sign contracts and invitations in inky flourish. Many believe it governs etiquette among wilder Pokémon-like beings.",
    "frontKeywords": "tuxedo otter, top hat, monocle, bowtie, black and white, polite expression, upright stance, blue eyes, formalwear, charming",
    "backKeywords": "short black tail with gray tip, back of tuxedo coat, top hat rim, small rounded ears, short limbs, standing posture",
    "image": "Dapperink.png"
  },
  {
    "id": "51",
    "name": "Sporecroak",
    "oldName": "Mycoglop",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "0.8",
    "pokedex": "Dwelling in shadowy wetlands, this toxic toad uses the spores on its back to lull foes into hallucinations before striking.",
    "frontKeywords": "spotted teal frog, yellow eyes, mushrooms growing from back, drooling mouth",
    "backKeywords": "fungus cluster, warty back, crouching position, toxic aura",
    "image": "Sporecroak.png"
  },
  {
    "id": "52",
    "name": "Blazewing",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Blazewing is a fierce firebird that commands the skies with flame-charged wings. Its screeches ignite sparks in the air, and it is often seen circling volcano peaks as both hunter and sentinel.",
    "frontKeywords": "red firebird, outstretched wings, black feathers, aggressive stance, talons out, blazing eyes, elemental raptor, high contrast body",
    "backKeywords": "large wing span, flame accents on feathers, layered tail plumage, muscled back, claws partially visible, fire-patterned back",
    "image": "Blazewing.png"
  },
  {
    "id": "53",
    "name": "Sunleo",
    "oldName": "Luxpyrion",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1.1",
    "pokedex": "Radiating warmth and joy, this cub embodies the sun’s gentle power, its mane blooming like a sunflower.",
    "frontKeywords": "golden lion cub, sunflower mane, big eyes, leaf-tufted tail",
    "backKeywords": "sitting upright, floral mane fully open, symmetrical face, fluffy paws",
    "image": "Sunleo.png"
  },
  {
    "id": "54",
    "name": "H2Roar",
    "oldName": "Hydronox",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1.2",
    "pokedex": "Charging through rivers with explosive force, H2Roar's roar shakes the riverbed and frightens away intruders.",
    "frontKeywords": "blue hippo, angry face, splash effects, lightning spines",
    "backKeywords": "water surge, glowing back, stomping motion",
    "image": "H2Roar.png"
  },
  {
    "id": "55",
    "name": "Bamboom",
    "oldName": "Cubruster",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1.2",
    "pokedex": "Bamboom is a bold, bushy warrior of the canopy, its bright red fur and tiny wings marking it as a fearless guardian of the wild. It is playful, but when danger threatens the forest, it charges in with explosive force and a booming cry.",
    "frontKeywords": "red panda creature, star crest, red wings, muscular stance, heroic pose, yellow eyes, small limbs, fluffy tail, confident smile",
    "backKeywords": "red mohawk from behind, fluffy striped tail, wing tips visible, stocky build, thick back fur, standing posture, power stance",
    "image": "Bamboom.png"
  },
  {
    "id": "56",
    "name": "Koikoi",
    "oldName": "Lotaflume",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "0.8",
    "pokedex": "A peaceful spirit said to bring luck to travelers. Its lotus-petal fins gently ripple the surface of sacred ponds.",
    "frontKeywords": "lotus fish, pink fins, serene eyes, golden scales",
    "backKeywords": "petal tail, soft glow, flowing form",
    "image": "Koikoi.png"
  },
  {
    "id": "57",
    "name": "Nutzo",
    "oldName": "Scuffernut",
    "types": "Ground",
    "evolutions": [
      [
        "Chubbybun",
        "Level",
        "24"
      ]
    ],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "0.8",
    "pokedex": "A fiery acorn with a mischievous streak, Nutzo charges around forests causing playful chaos. Its bark is worse than its bite—barely.",
    "frontKeywords": "angry acorn, wooden body, leafy limbs, mischievous face, small forest creature, orange cheeks",
    "backKeywords": "acorn cap from behind, leafy back limbs, squat forest figure, stubborn posture",
    "image": "Nutzo.png"
  },
  {
    "id": "58",
    "name": "Chubbybun",
    "oldName": "Scornut",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "Chubbybun is a mischievous brawler bunny with oversized cheeks and an even bigger ego. It boxes with pride and hops with unstoppable swagger.",
    "frontKeywords": "tough bunny, puffed cheeks, orange fur, brown ears, raised fists, cocky smirk, upright tail, fighter stance",
    "backKeywords": "bushy striped tail, strong hind legs, back tufts, upright rabbit ears, wide-footed pose",
    "image": "Chubbybun.png"
  },
  {
    "id": "59",
    "name": "Pinkachu",
    "oldName": "Charmink",
    "types": "Normal",
    "evolutions": [
      [
        "Bloomgrin",
        "Item",
        "Moonstone"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "A lovable sprite of cheer, its charm lies in spreading kindness and delight wherever it bounds.",
    "frontKeywords": "pink cat, white paws, flower tail, cute eyes, gold bands",
    "backKeywords": "tail curve, sitting pose, shy smile, pastel fur",
    "image": "Pinkachu.png"
  },
  {
    "id": "60",
    "name": "Bloomgrin",
    "oldName": "Cherrifern",
    "types": "Normal,Fairy",
    "evolutions": [],
    "moves": "sweetkiss,disarmingvoice,disable,charm",
    "size": "1",
    "pokedex": "This mischievous floral feline uses its camouflage and wide grin to play tricks on wanderers. Bloomgrin thrives in cherry blossom groves, where its petal-covered body lets it blend in effortlessly before pouncing with laughter.",
    "frontKeywords": "pink floral cat, wide grin, flower fur, cherry blossom petals, smug expression, leafy tail, nature trickster, cute and creepy",
    "backKeywords": "petal-covered back, fluffy tail with blossoms, flower-studded fur, rear paw stance, leaf texture on shoulders, floral fluff",
    "image": "Bloomgrin.png"
  },
  {
    "id": "61",
    "name": "Glacilamb",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "This gentle ram uses its icy horn to freeze paths and protect its herd, radiating calm energy in the coldest climates.",
    "frontKeywords": "blue ram, icy horn, woolly coat, serene expression",
    "backKeywords": "fluffy back, icy tail, short legs, frosted wool",
    "image": "Glacilamb.png"
  },
  {
    "id": "62",
    "name": "Cinderlamb",
    "oldName": "Emberuff",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Cinderlamb is a fiery sheep whose wool burns with undying flames. It brings warmth to cold pastures and scorches enemies with a flash of heat.",
    "frontKeywords": "fire lamb, orange mane, cream wool, gentle eyes, flame horns, blazing hair, standing still, ember glow",
    "backKeywords": "flaming mane behind ears, rounded wool back, slight smoke trail, small hooves, bushy tail flick",
    "image": "Cinderlamb.png"
  },
  {
    "id": "63",
    "name": "Mosslamb",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Covered in mossy fleece and crowned with gentle horns, Mosslamb is a forest dweller said to bring peace and regrowth wherever it rests.",
    "frontKeywords": "green lamb, ram horns, moss coat, cute animal, forest spirit, curled tail, soft features",
    "backKeywords": "round mossy back, tail tufts, horned rear, peaceful stance from behind",
    "image": "Mosslamb.png"
  },
  {
    "id": "64",
    "name": "Cactini",
    "oldName": "Thornbloom",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "Cactini is a potted cactus sprite who cheers on plants with quiet optimism. It is said its presence helps gardens flourish.",
    "frontKeywords": "potted cactus, smiling face, glasses, soft green color, small arms, pink flowers, friendly expression, decorative plant creature",
    "backKeywords": "pot base, cactus arms from behind, flower crown visible, smooth cactus back, stubby round form, symmetrical arm curves",
    "image": "Cactini.png"
  },
  {
    "id": "65",
    "name": "Mammolith",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1.3",
    "pokedex": "This stoic behemoth roams ancient tundras, etching ancestral paths with each thundering step. Its patterned hide tells the story of forgotten civilizations.",
    "frontKeywords": "brown mammoth, ancient markings, tusks, tribal pattern, sturdy legs, solemn eyes, prehistoric creature, powerful build",
    "backKeywords": "mammoth from behind, patterned back, swaying tail, curved tusks side view, heavy fur coat",
    "image": "Mammolith.png"
  },
  {
    "id": "66",
    "name": "Woolrage",
    "oldName": "Velombra",
    "types": "Electric",
    "evolutions": [
      [
        "Woolhorn",
        "Level",
        "18"
      ]
    ],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "1",
    "pokedex": "Despite its gentle appearance, its gaze is unwavering and proud—its horns hum with ancient energy.",
    "frontKeywords": "fluffy white wool, dark head, moth-like horns, crimson eyes",
    "backKeywords": "side-facing stance, poised legs, dark brown wool patches, regal presence",
    "image": "Woolrage.png"
  },
  {
    "id": "67",
    "name": "Woolhorn",
    "oldName": "Voltombre",
    "types": "Electric",
    "evolutions": [
      [
        "Wooluff",
        "Level",
        "26"
      ]
    ],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "1",
    "pokedex": "This nimble critter sparks excitement with its bounding leaps and puffy tail, radiating contagious joy.",
    "frontKeywords": "black and white fur, fox-like ears, yellow tail tip, bright cheeks",
    "backKeywords": "mid-leap, open mouth smile, fluffy chest, lively eyes",
    "image": "Woolhorn.png"
  },
  {
    "id": "68",
    "name": "Wooluff",
    "oldName": "Baaronox",
    "types": "Electric",
    "evolutions": [],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "1",
    "pokedex": "With a sharp wit and mischievous glare, this wooly imp never backs down from a challenge.",
    "frontKeywords": "small demon goat, black wool, curled horns, red eyes",
    "backKeywords": "arms crossed, smug smirk, pointy tail, confident posture",
    "image": "Wooluff.png"
  },
  {
    "id": "69",
    "name": "Hydroxis",
    "oldName": "Hydroscourge",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1.2",
    "pokedex": "Legends say Hydroxis was born from the fusion of elemental spirits, each head controlling a different force of nature. It maintains balance with terrifying grace.",
    "frontKeywords": "hydra, elemental heads, glowing eyes, stormy aura",
    "backKeywords": "multiple tails, intertwining necks, glowing runes",
    "image": "Hydroxis.png"
  },
  {
    "id": "70",
    "name": "Brambumble",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Brambumble is a gentle forest spirit with soft fur and leafy decorations. Golden fruits grow from its branch-like horns, which it shares with kindhearted wanderers.",
    "frontKeywords": "round forest creature, golden eyes, leafy antlers, bushy fur, standing upright, smiling expression, plant fur, fruit-bearing",
    "backKeywords": "leaf crown visible, soft back fluff, rounded shape, short legs, leafy spine details, nature puffball",
    "image": "Brambumble.png"
  },
  {
    "id": "71",
    "name": "Bellivy",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "0.8",
    "pokedex": "Bellivy is a cheerful forest fox whose leafy mane is always rustling in the wind. It jingles with every step thanks to the enchanted bell around its neck, said to protect those who hear it. Wildflowers bloom in its fur during spring.",
    "frontKeywords": "forest fox, big leaf mane, red flower crown, golden fur, bell accessory, cheerful expression, leafy creature, cartoon style, standing pose",
    "backKeywords": "leaf tuft on back of head, bell seen from ribbon, thick leaf collar from behind, fox tail curled, upright ears, soft fur pattern",
    "image": "Bellivy.png"
  },
  {
    "id": "72",
    "name": "Cactraddle",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "Cactraddle is a desert serpent with a crown of cactus blooms. It slithers slowly but surely across sand dunes, trailing fertility in its wake.",
    "frontKeywords": "green snake dinosaur, flower crown, plant ridges, long neck, smiling face, desert flora, grounded pose, peaceful aura",
    "backKeywords": "flower head crest from behind, long tail coils, cactus patches along back, gentle back slope, curved pose",
    "image": "Cactraddle.png"
  },
  {
    "id": "73",
    "name": "Crayzard",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Crayzard is a mischievous crayon-box monster who colors chaos wherever it goes. It throws crayons like missiles and redraws reality with a sneer.",
    "frontKeywords": "living crayon box, angry face, colorful crayons, orange limbs, cartoon aesthetic, boxy body, artistic chaos",
    "backKeywords": "crayons sticking from back, green tail, box flaps, symmetrical crayon rows, back of label stripes",
    "image": "Crayzard.png"
  },
  {
    "id": "74",
    "name": "Grumblin",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "A perpetually upset blob-like creature, it stomps about in frustration, causing minor tremors when irritated.",
    "frontKeywords": "angry blob, pink cheeks, squinty eyes, short limbs",
    "backKeywords": "rounded back, hunched stance, clenched fists",
    "image": "Grumblin.png"
  },
  {
    "id": "75",
    "name": "Chocobaby",
    "oldName": "Flickerlet",
    "types": "Fire",
    "evolutions": [
      [
        "Foenix",
        "Level",
        "30"
      ]
    ],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "0.8",
    "pokedex": "Chocobaby is a chirping hatchling of flame, made of toasted fluff and caramel feathers. It bobs with joy and spreads warmth wherever it hops.",
    "frontKeywords": "round fire chick, golden feathers, happy eyes, small wings, toasted glow, tiny beak, glowing baby bird",
    "backKeywords": "rounded back fluff, small tail flick, wing tips raised, chick form silhouette, radiant feathers",
    "image": "Chocobaby.png"
  },
  {
    "id": "76",
    "name": "Foenix",
    "oldName": "Pyrockadoo",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Foenix is the flame reborn, rising from ash with the pride of a thousand lifetimes. Its cry rekindles dying fires.",
    "frontKeywords": "fiery phoenix, golden wings, burning crest, strong talons, sharp eyes, flame bird",
    "backKeywords": "arching wing blaze, fiery feathers, muscular back, blazing tail plumage, powerful stance",
    "image": "Foenix.png"
  },
  {
    "id": "77",
    "name": "Glidaleaf",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Glidaleaf drifts effortlessly from tree to tree using its leaf-glider arms, spreading pollen that calms agitated creatures.",
    "frontKeywords": "green flying squirrel, leaf arms, excited pose, open mouth",
    "backKeywords": "gliding pose, leafy wings extended, upright tail",
    "image": "Glidaleaf.png"
  },
  {
    "id": "78",
    "name": "Purby",
    "oldName": "Nocturhaze",
    "types": "Dark",
    "evolutions": [
      [
        "Twihoot",
        "Level",
        "29"
      ]
    ],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "Mysterious and wise, Purby's feathers ripple like mist. Said to guide lost souls in enchanted woods, it stares into your heart with its glowing violet gaze.",
    "frontKeywords": "regal purple bird, smoky feathers, glowing violet eyes, elegant posture, ghostly aura",
    "backKeywords": "purple spectral bird back view, misty wings, glowing outline, owl stance",
    "image": "Purby.png"
  },
  {
    "id": "79",
    "name": "Twihoot",
    "oldName": "Obscurion",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "A nocturnal oracle that guards forest secrets, its glowing sigil eyes can read the wind for danger.",
    "frontKeywords": "purple owl, glowing tribal markings, gemstone pendant, serious gaze",
    "backKeywords": "tall stance, wings folded, narrowed eyes, mystic aura",
    "image": "Twihoot.png"
  },
  {
    "id": "80",
    "name": "Liluxi",
    "oldName": "",
    "types": "Water",
    "evolutions": [
      [
        "Pixlotl",
        "Level",
        "19"
      ]
    ],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "A gentle guardian of ponds, it rests in flower petals and shares calm energy with those nearby.",
    "frontKeywords": "pastel axolotl, pink wings, lotus petal seat, leafy sprout on head",
    "backKeywords": "leaf sprout from behind, petal base, serene pond vibe",
    "image": "Liluxi.png"
  },
  {
    "id": "81",
    "name": "Pixlotl",
    "oldName": "Luminelix",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "Pixlotl is said to be born from the stars that fell into crystal lakes. It communicates with sparkles in its eyes and dances across lily pads under the moonlight.",
    "frontKeywords": "adorable blue axolotl, pastel pink feathered gills, sparkly anime eyes, smooth skin, magical mascot",
    "backKeywords": "blue axolotl back view, gill frills, aquatic tail, rounded body, fantasy creature",
    "image": "Pixlotl.png"
  },
  {
    "id": "82",
    "name": "Drowsloth",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Sporelax",
        "Item",
        "Leafstone"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "A gentle soul who embodies the essence of rest, Drowsloth can nap through earthquakes or lull others to sleep with its steady breathing. Its soft fur is rumored to emit calming pheromones.",
    "frontKeywords": "fluffy sloth, cream and blue, closed eyes, peaceful smile, sitting, round body, sleepy posture, large hands, fuzzy texture, calm",
    "backKeywords": "rounded back, small arms folded, blue markings behind head, fluffy hair tufts, tail tucked under",
    "image": "Drowsloth.png"
  },
  {
    "id": "83",
    "name": "Sporelax",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "This sleepy creature lounges under trees all day, gathering spores on its fur which calm even the rowdiest Pokémon.",
    "frontKeywords": "shaggy green fur, mushroom cap on head, droopy eyes, relaxed stance",
    "backKeywords": "fluffy back, mushroom sprout, arms hanging, dozing pose",
    "image": "Sporelax.png"
  },
  {
    "id": "84",
    "name": "Bluffin",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Soluna",
        "Item",
        "Moonstone"
      ],
      [
        "Florabun",
        "Item",
        "Leafstone"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Bluffin is a plump, cream-colored critter with boundless energy and curiosity. It squeaks playfully when excited and often tumbles through soft grass fields in joyful rolls. Its wide ears pick up even the gentlest sounds.",
    "frontKeywords": "cream puff creature, wide ears, big blue eyes, round fluffy body, playful pose, soft fur, cartoon style, rabbit-fox hybrid",
    "backKeywords": "puffy tail, large ear backs, rounded back, chubby haunches, dense fluffy texture, upright cute posture",
    "image": "Bluffin.png"
  },
  {
    "id": "85",
    "name": "Soluna",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1",
    "pokedex": "A serene fox-like creature that embodies balance between day and night, known for guiding lost travelers under the twin skies.",
    "frontKeywords": "long-haired fox, golden fur, large upright ears, white chest fur, gentle gaze",
    "backKeywords": "flowing hair, split-tone tail, poised sitting, glowing aura",
    "image": "Soluna.png"
  },
  {
    "id": "86",
    "name": "Mellibee",
    "oldName": "",
    "types": "Grass",
    "evolutions": [
      [
        "Feyflutter",
        "Level",
        "15"
      ]
    ],
    "moves": "absorb,bind,stunspore,growth",
    "size": "0.8",
    "pokedex": "With wings like stained glass and a heart full of pollen, Mellibee dances through meadows spreading joy and golden dust wherever it flutters.",
    "frontKeywords": "fluffy butterfly, pastel wings, big blue eyes, cute insect, soft body, cheerful expression",
    "backKeywords": "butterfly from behind, light wings, fuzzy back, floating insect, magical flutter",
    "image": "Mellibee.png"
  },
  {
    "id": "87",
    "name": "Feyflutter",
    "oldName": "Veluvielle",
    "types": "Grass",
    "evolutions": [
      [
        "Floramene",
        "Level",
        "27"
      ]
    ],
    "moves": "absorb,bind,stunspore,growth",
    "size": "0.9",
    "pokedex": "Feyflutter is a graceful spirit of dusk, fluttering silently through twilight forests. Its wings shimmer with the last light of day.",
    "frontKeywords": "fairy moth, lavender wings, glowing antennae, delicate arms, mystical gaze, dusk tones",
    "backKeywords": "shimmering wing patterns, tapering tail, slender back, iridescent hues, elegant silhouette",
    "image": "Feyflutter.png"
  },
  {
    "id": "88",
    "name": "Floramene",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Floramene is an elegant plant spirit that governs blooming cycles. Her movements are like wind through petals.",
    "frontKeywords": "plant goddess, leafy limbs, petal cloak, golden eyes, serene expression, long flowing hair",
    "backKeywords": "petal strands, trailing leaf hair, slender back, elegant cape shape, botanical glow",
    "image": "Floramene.png"
  },
  {
    "id": "89",
    "name": "Ophidiax",
    "oldName": "",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1",
    "pokedex": "A mythical serpent said to whisper truths from the underworld, its many heads never sleep, watching in all directions.",
    "frontKeywords": "hydra, gold scales, many heads, pink eyes, coiling body",
    "backKeywords": "serpent tails, diamond pattern, winding limbs, side view",
    "image": "Ophidiax.png"
  },
  {
    "id": "90",
    "name": "Thimbla",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "0.9",
    "pokedex": "Tiny but brave, it dons a thimble helm like a knight’s helm and defends garden folk with fuzzy valor.",
    "frontKeywords": "mint green fluffball, thimble helmet, pink ribbon, wide eyes",
    "backKeywords": "floating midair, tufted limbs, ribbon trailing, metal helm gleaming",
    "image": "Thimbla.png"
  },
  {
    "id": "91",
    "name": "Pyruffin",
    "oldName": "",
    "types": "Fire",
    "evolutions": [
      [
        "Ignix",
        "Level",
        "35"
      ]
    ],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "0.9",
    "pokedex": "Despite its soft appearance, Pyruffin is a fierce protector of the skies. Its tiny wings emit warm updrafts during battle.",
    "frontKeywords": "fluffy orange fox-dragon, large golden wings, round red eyes, soft fur, fantasy hybrid",
    "backKeywords": "fox creature back view, feathery wings extended, curled tail, chubby pose",
    "image": "Pyruffin.png"
  },
  {
    "id": "92",
    "name": "Ignix",
    "oldName": "Solariscreed",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Majestic and proud, Ignix is said to nest in the sun’s shadow. When it spreads its wings, the air itself ignites.",
    "frontKeywords": "phoenix, blazing feathers, talon raised, glowing crest",
    "backKeywords": "ember sparks, fanned wings, golden tail plume",
    "image": "Ignix.png"
  },
  {
    "id": "93",
    "name": "Starnip",
    "oldName": "",
    "types": "Mythic,Dark",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "0.9",
    "pokedex": "Eager and curious, this star-kitten is always on the move, chasing comets and glowing with cosmic delight.",
    "frontKeywords": "playful blue kitten, bright golden stars, curled striped tail, white chest",
    "backKeywords": "pouncing stance, perked ears, tail raised, vibrant fur patterns",
    "image": "Starnip.png"
  },
  {
    "id": "94",
    "name": "Starbite",
    "oldName": "Noctigris",
    "types": "Mythic,Dark",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1",
    "pokedex": "A mischievous feline from the night sky, it’s said to leap between dreams, biting starlight and scattering sparks of mischief.",
    "frontKeywords": "midnight blue cat, golden star markings, striped tail, glowing orange eyes",
    "backKeywords": "arched pose, tail curled up, glinting fur, star-streaked back",
    "image": "Starbite.png"
  },
  {
    "id": "95",
    "name": "Raindeer",
    "oldName": "",
    "types": "Water",
    "evolutions": [
      [
        "Frosthorn",
        "Item",
        "Icestone"
      ]
    ],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1.2",
    "pokedex": "A spirit of wintry joy, Raindeer brings snowfall wherever it gallops. Children believe it dances on rooftops during festival nights.",
    "frontKeywords": "white cartoon deer, red hooves, blue eyes, joyful prance, soft fur",
    "backKeywords": "reindeer back view, short tail, curved antlers, smooth cream coat",
    "image": "Raindeer.png"
  },
  {
    "id": "96",
    "name": "Snugdrake",
    "oldName": "Cogsprite",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "A gentle dragon who treasures comfort above all, often seen clutching a plush companion.",
    "frontKeywords": "green plush dragon, scarf, toy bear, kind eyes, chubby limbs",
    "backKeywords": "tail curl, plush texture, round wings, stuffed companion, soft aesthetic",
    "image": "Snugdrake.png"
  },
  {
    "id": "97",
    "name": "Galeclaw",
    "oldName": "Avireign",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "A guardian bird with powerful talons, Galeclaw raises its young in mountain cliffs. Its feathers shimmer with wind energy.",
    "frontKeywords": "eagle mother, rainbow tail feathers, stern expression, curved beak",
    "backKeywords": "spread brown wings, baby chick beside, layered tail plumage",
    "image": "Galeclaw.png"
  },
  {
    "id": "98",
    "name": "Galestorm",
    "oldName": "Pyraethon",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1.2",
    "pokedex": "Swift and fierce, Galestorm rides the winds during violent storms. Its sharp feathers slice through the air like blades.",
    "frontKeywords": "snowy raptor, stormy expression, sharp red eyes, maple crest",
    "backKeywords": "back swept wings, muscular legs, wind-cutting feather shapes",
    "image": "Galestorm.png"
  },
  {
    "id": "99",
    "name": "Bristawild",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "0.8",
    "pokedex": "Bristawild is a defensive woodland warrior with razor quills and large claws. It uses its digging skills to create protective burrows and ambush threats with calculated strikes.",
    "frontKeywords": "hedgehog warrior, sharp quills, strong claws, tan and brown fur, alert eyes, spiky back, combat pose, burrower design",
    "backKeywords": "dense quill formation, bristled back arc, long clawed arms, raised rear posture, brown-spined shape",
    "image": "Bristawild.png"
  },
  {
    "id": "100",
    "name": "Gourmuffin",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Shaped like a smiling jack-o'-lantern, this creature lures travelers in autumn woods, sharing light and warmth.",
    "frontKeywords": "pumpkin head, glowing smile, cozy cloak, autumn theme",
    "backKeywords": "gourd-shaped back, leaf satchel, curled feet, warm glow",
    "image": "Gourmuffin.png"
  },
  {
    "id": "101",
    "name": "Starmiri",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "0.8",
    "pokedex": "A cheerful spirit that dances at dusk, its soft glow guiding travelers toward hope and wonder.",
    "frontKeywords": "chubby yellow sprite, lavender ribbon arms, star-shaped antenna, smiling face",
    "backKeywords": "floating posture, twirling ribbons, soft ombre body, playful tilt",
    "image": "Starmiri.png"
  },
  {
    "id": "102",
    "name": "Brutalocust",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Brutalocust is a towering insectoid warrior clad in armor. Its wings slice air like blades, and its drills can burrow into stone. It is revered as a bringer of storms in ancient lore.",
    "frontKeywords": "black armored bug, red eyes, drill limbs, beetle plating, strong stance, blade wings, insect warrior, menacing form",
    "backKeywords": "armored shell back, drills visible from behind, blade wings spread, segmented plates, heavy bug silhouette",
    "image": "Brutalocust.png"
  },
  {
    "id": "103",
    "name": "Papyrion",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Born from parchment and wind, this silent flyer is said to be a messenger between realms, light as a whisper.",
    "frontKeywords": "moth ears, orange wings, folded hands, sandy fur",
    "backKeywords": "wing patterns, back claws, sitting pose, light tones",
    "image": "Papyrion.png"
  },
  {
    "id": "104",
    "name": "Solcub",
    "oldName": "",
    "types": "Normal,Grass",
    "evolutions": [],
    "moves": "tackle,camouflage,growl,sandattack",
    "size": "1",
    "pokedex": "This cheerful lion cub absorbs sunlight through its mane of petals, storing energy to share warmth and hope with others.",
    "frontKeywords": "sunflower mane, golden cub, bright eyes, sitting pose, warm expression",
    "backKeywords": "petal mane, golden tail tip, back turned, soft glow",
    "image": "Solcub.png"
  },
  {
    "id": "105",
    "name": "Crescyon",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "Crescyon is a silent moon-runner who bends shadows with its horns. It’s a phantom of twilight and leaves no trail when it strides.",
    "frontKeywords": "elegant black deer, blue horn swirls, lean body, blue hooves, glowing eyes, nocturnal spirit, sleek stance",
    "backKeywords": "horn curls glow from behind, tail sweep to side, back arch in motion, slender leg lines, moonlit silhouette",
    "image": "Crescyon.png"
  },
  {
    "id": "106",
    "name": "Dreadmare",
    "oldName": "",
    "types": "Water,Dark",
    "evolutions": [],
    "moves": "aquajet,leer,poisonfang,focusenergy",
    "size": "1",
    "pokedex": "Shrouded in shadows and feared in folklore, Dreadmare is said to gallop across battlefields as a harbinger of ruin. Its fiery mane blazes through the night, and its eyes gleam with an eternal, vengeful fury.",
    "frontKeywords": "dark horse, flaming mane, red eyes, aggressive stance, black body, fire effects, mythic steed, dramatic lighting, fire aura, spectral",
    "backKeywords": "flaming tail, burning mane flow, muscular hind legs, black coat texture, fire trails, smoke effects",
    "image": "Dreadmare.png"
  },
  {
    "id": "107",
    "name": "Cryonix",
    "oldName": "",
    "types": "Ice",
    "evolutions": [],
    "moves": "powdersnow,astonish,leer,doubleteam",
    "size": "0.9",
    "pokedex": "Cryonix is a holy bird of glaciers, forged in pristine silence. Its diamond-hard feathers reflect starlight and its ring guides lost travelers.",
    "frontKeywords": "ice penguin, diamond feathers, glowing halo, icy stare, blue sheen, triangular body, snow guardian",
    "backKeywords": "halo floats above head, diamond back plating, wing tips from behind, crystal tail, smooth back curve",
    "image": "Cryonix.png"
  },
  {
    "id": "108",
    "name": "Wurmcoil",
    "oldName": "Solssile",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1.2",
    "pokedex": "A primal beast cloaked in crystals and moss, its heavy steps shake the ground it treads.",
    "frontKeywords": "crystal spikes, moss covering, glowing yellow eye, tusked mask",
    "backKeywords": "slug-like body, horned faceplate, earthy tones, hunched posture",
    "image": "Wurmcoil.png"
  },
  {
    "id": "109",
    "name": "Bonecaw",
    "oldName": "Noctavain",
    "types": "Dark",
    "evolutions": [
      [
        "Corvoss",
        "Level",
        "34"
      ]
    ],
    "moves": "snarl,foulplay,covet,swift",
    "size": "0.9",
    "pokedex": "Bonecaw is a silent omen perched in graveyards and battlefields, its bone mask hiding an unknowable gaze. It watches from the shadows, speaking only in clicks and caws to those who are marked by fate.",
    "frontKeywords": "dark crow, bone mask, eerie purple eyes, gothic bird, standing pose, death motif, spectral avian, quiet watcher",
    "backKeywords": "black feathered back, mask ridge visible from top, sharp clawed feet, hunched silhouette, matte feathers, long tail feathers",
    "image": "Bonecaw.png"
  },
  {
    "id": "110",
    "name": "Corvoss",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "Corvoss is a ghostly harbinger that flies through grave winds. Its skeletal frame and spectral feathers mark it as a guardian of lost souls.",
    "frontKeywords": "undead crow, skeletal chest, plague mask beak, purple glowing eye, dark feathers, haunting wings, grim reaper bird",
    "backKeywords": "spine exposed from behind, feather tips with eye pattern, ghostly mist trail, raised bone wings, talon silhouette",
    "image": "Corvoss.png"
  },
  {
    "id": "111",
    "name": "Cubby",
    "oldName": "Pandaloo",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Cubby is a bubbly cub who skips through forests looking for berries. Its round belly and curious paws make it a friend to all.",
    "frontKeywords": "playful bear cub, black and white fur, happy smile, rounded body, forest child, wide eyes, cartoon paws",
    "backKeywords": "fluffy tail, rounded back, black fur curve, tiny ears from behind, soft rear legs",
    "image": "Cubby.png"
  },
  {
    "id": "112",
    "name": "Bambuzzleaf",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1.2",
    "pokedex": "Bambuzzleaf is a bamboo forest guardian with a leafy mantle and a boisterous spirit. Though round and cuddly in appearance, it defends its home fiercely with mighty roars and a thumping charge. The leaf sprouting from its head pulses when it senses danger nearby.",
    "frontKeywords": "leaf panda, chubby body, green leaf collar, bamboo-inspired, cartoon bear, plant creature, open mouth, earthy tones, playful stance",
    "backKeywords": "round back, leafy cape from behind, small ears, central leaf sprout, dark fur body, wide plant-textured back",
    "image": "Bambuzzleaf.png"
  },
  {
    "id": "113",
    "name": "Piprism",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Legends say Piprism carries the first colors of spring in its wings. Wherever it flutters, flowers bloom in its wake.",
    "frontKeywords": "cute green bird creature, large peacock butterfly wings, bright pink eyes, gem brooch, teal feathers",
    "backKeywords": "emerald bird back view, spread teal-blue butterfly wings, feather cape, standing pose",
    "image": "Piprism.png"
  },
  {
    "id": "114",
    "name": "Lumenip",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Shardscale",
        "Level",
        "37"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "With glowing horns and a sunny attitude, this miniature dragon brings light to dark caverns.",
    "frontKeywords": "small golden dragon, curved horns, soft wings, excited expression",
    "backKeywords": "glowing back, light wings, perky tail, golden fluff",
    "image": "Lumenip.png"
  },
  {
    "id": "115",
    "name": "Shardscale",
    "oldName": "",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1",
    "pokedex": "Born of ice and crystal, this dragon’s body gleams like a frozen gem, with wings as sharp as sapphire blades.",
    "frontKeywords": "crystal dragon, icy blue body, sapphire wings, small horns",
    "backKeywords": "glittering spine, folded crystal wings, reflective tail, gem-like texture",
    "image": "Shardscale.png"
  },
  {
    "id": "116",
    "name": "Embermane",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1.1",
    "pokedex": "Galloping through burning meadows, Embermane is a fierce stallion made of shadow and flame. Legends speak of it defending sacred volcanic lands, its mane trailing fire and fury.",
    "frontKeywords": "black fire horse, blazing mane and tail, red eyes, fierce expression, muscular build, rearing pose, fire aura, wild mane, glowing effects, mythic",
    "backKeywords": "flowing fire tail, flared hooves, trailing mane, arched back, rearing posture, burning trail",
    "image": "Embermane.png"
  },
  {
    "id": "117",
    "name": "Ignisurge",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1.2",
    "pokedex": "This fiery steed gallops across volcanic plains, leaving trails of flame in its wake. Its mane burns with the passion of battle.",
    "frontKeywords": "horse, flowing fire mane, fierce eyes, muscular frame",
    "backKeywords": "fiery tail, flaming hoofprints, ash-scorched coat",
    "image": "Ignisurge.png"
  },
  {
    "id": "118",
    "name": "Shroomlingo",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Camouflaged among mushrooms, this strange flamingo has developed a symbiotic bond with fungal colonies.",
    "frontKeywords": "mushroom flamingo, orange toadstool hat, thin legs, tan feathers, fungal habitat",
    "backKeywords": "mushroom cap, standing in grass, long neck curve, fungal camouflage, odd bird",
    "image": "Shroomlingo.png"
  },
  {
    "id": "119",
    "name": "Budbaa",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Budbaa is a gentle sun-loving lamb with sunflower blooms on its wool. Its fleece is warm and comforting, and its presence encourages crops to thrive.",
    "frontKeywords": "white sheep, sunflower on head, petal collar, fluffy wool, pastel fur, smiling face, yellow bloom, plant-lamb hybrid",
    "backKeywords": "large flower on back, wooly back body, soft tail, back hooves visible, round sheep silhouette, golden accents",
    "image": "Budbaa.png"
  },
  {
    "id": "120",
    "name": "Skylume",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "A bright and chirpy bird that guides lost travelers by reflecting sunlight with its colorful feathers.",
    "frontKeywords": "tiny bird, pastel feathers, yellow-pink-green wings, open beak, round body",
    "backKeywords": "spread wings, tail fan, glowing tips, soft silhouette, airborne pose",
    "image": "Skylume.png"
  },
  {
    "id": "121",
    "name": "Hawklet",
    "oldName": "Crepuskra",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "This spirited little bird soars from tree to tree, practicing aerial maneuvers from dawn until dusk. Its wings shimmer with the colors of autumn.",
    "frontKeywords": "small bird, orange wings, crest feather, perched",
    "backKeywords": "sharp tail, folded wings, green feathers",
    "image": "Hawklet.png"
  },
  {
    "id": "122",
    "name": "Buzzlette",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "0.8",
    "pokedex": "Buzzlette is a sprout bee who sleeps in flowerbeds and hums in harmony with sun rays. It blooms with pollen joy, surrounded by petals of protection.",
    "frontKeywords": "bee fairy, petal dress, round body, yellow fur, pink cheeks, leafy sprout, antennae, joyful, plant-bug hybrid",
    "backKeywords": "flower petal skirt, black-striped back, leafy top detail, stubby wings, wide base of petals, bee stripes",
    "image": "Buzzlette.png"
  },
  {
    "id": "123",
    "name": "Voltitan",
    "oldName": "",
    "types": "Electric",
    "evolutions": [],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "1",
    "pokedex": "Forged in storm and fury, this beast crackles with enough power to black out cities when enraged.",
    "frontKeywords": "orange demon dragon, horns, lightning eyes, trident staff, fire cape",
    "backKeywords": "roaring pose, electric sparks, raised claw, dynamic stance",
    "image": "Voltitan.png"
  },
  {
    "id": "124",
    "name": "Gizmo",
    "oldName": "Scorfluff",
    "types": "Ground,Fire",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "Gizmo is a hyperactive creature that zips between gadgets and wires, often leaving sparks behind. It thrives in areas full of technology.",
    "frontKeywords": "tiny gremlin, wild fur, big grin, energetic pose",
    "backKeywords": "fluffy back, stubby tail, faint static arcs",
    "image": "Gizmo.png"
  },
  {
    "id": "125",
    "name": "Brinzelda",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1.1",
    "pokedex": "Brinzelda is a cheerful bug-fairy that spreads joy and pollen as it flutters through meadows. Its wings sparkle in sunlight, and its laughter is said to cure gloom.",
    "frontKeywords": "green insect fairy, sparkly wings, red cheeks, wide grin, tiny antennae, round body, whimsical vibe, flying stance",
    "backKeywords": "glassy wings from behind, soft green back, curled tail, antennae barely visible, chubby back figure",
    "image": "Brinzelda.png"
  },
  {
    "id": "126",
    "name": "Skyrion",
    "oldName": "",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1",
    "pokedex": "Born from windswept mountain peaks, this noble creature is said to command both lightning and loyalty.",
    "frontKeywords": "small griffon, orange wings, blue crest, sharp eyes, bow tie",
    "backKeywords": "feathered wings, proud stance, tail flare, mountain guardian, regal pose",
    "image": "Skyrion.png"
  },
  {
    "id": "127",
    "name": "Zephyrex",
    "oldName": "",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1.2",
    "pokedex": "Majestic and proud, it soars with a gale behind it—this regal beast inspires awe with every wingbeat.",
    "frontKeywords": "griffin-like creature, white feathers, black hindlegs, golden horns",
    "backKeywords": "wings flared, battle-ready roar, flowing mane, strong posture",
    "image": "Zephyrex.png"
  },
  {
    "id": "128",
    "name": "Charmette",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Solhorn",
        "Level",
        "26"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Charmette is a spunky feline with a flair for drama and ribbons. It’s always prancing and loves attention, charming everyone with its vibrant personality and energetic curls.",
    "frontKeywords": "stylish cat, red ponytail, blue ribbon, white fur, bright eyes, curled tail, playful pose, fashion flair",
    "backKeywords": "hair tie ribbon from behind, curled tail motion, sleek white fur, blue accent trail, back paw lift",
    "image": "Charmette.png"
  },
  {
    "id": "129",
    "name": "Solhorn",
    "oldName": "Regalette",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1.2",
    "pokedex": "A fierce and majestic guardian of the mountains, SOLHORN channels solar energy through its crystal chest to ward off darkness.",
    "frontKeywords": "white unicorn-ram hybrid, blazing orange mane, spiral horns, muscular build, gemstone chest",
    "backKeywords": "flowing orange tail, sun-charged gem, sturdy back, poised stance",
    "image": "Solhorn.png"
  },
  {
    "id": "130",
    "name": "Voltuff",
    "oldName": "",
    "types": "Electric",
    "evolutions": [],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "1",
    "pokedex": "Always bouncing and barking, this lion cub stores static in its fur and discharges it in energetic pounces.",
    "frontKeywords": "brown lion cub, golden fluff, diamond forehead gem, fluffy tail",
    "backKeywords": "playful leap, arched back, tail puffed up, cheerful expression",
    "image": "Voltuff.png"
  },
  {
    "id": "131",
    "name": "Shellvis",
    "oldName": "Regastroa",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "A wise and graceful snail, its ornate shell is said to hold the secrets of ancient rainfall rituals.",
    "frontKeywords": "ornate snail, cream body, green patterned shell, calm expression, elegant antennae",
    "backKeywords": "spiraled shell, floral motifs, trailing slime, slow movement, symmetrical form",
    "image": "Shellvis.png"
  },
  {
    "id": "132",
    "name": "Grudgecub",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "Despite its size, Grudgecub is aggressive and territorial, often baring claws to scare off even larger foes.",
    "frontKeywords": "angry bear cub, hunched, sharp claws, hostile eyes",
    "backKeywords": "crouched posture, back claws visible, fluffy but tense",
    "image": "Grudgecub.png"
  },
  {
    "id": "133",
    "name": "Terrabud",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "A gentle spirit of the soil, this cheerful critter sprouts flowers wherever it walks, bringing life to barren ground.",
    "frontKeywords": "fox-like creature, soft orange fur, green leaf crown with flower, rounded tail",
    "backKeywords": "hands to cheeks, tail with blossom, standing upright, fur puffed",
    "image": "Terrabud.png"
  },
  {
    "id": "134",
    "name": "Orion",
    "oldName": "Zaptrix",
    "types": "Electric",
    "evolutions": [],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "1.2",
    "pokedex": "This celestial beast is believed to soar between stars, guiding lost souls with its burning mane and cosmic aura.",
    "frontKeywords": "black dragon, gold flames, glowing mane, cosmic wings, fierce eyes",
    "backKeywords": "tail swish, burning trail, wings flared, silhouette glow",
    "image": "Orion.png"
  },
  {
    "id": "135",
    "name": "Burrowrex",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "0.8",
    "pokedex": "Burrowrex is a reclusive digger that guards buried treasures and roots in the badlands. Its thick shell protects it from predators as it tunnels with sharp claws.",
    "frontKeywords": "armadillo dinosaur, plated shell, clawed limbs, red mask markings, crouched stance, desert dweller, rugged appearance",
    "backKeywords": "rounded back shell, tail visible, armor ridges, large hind claws, back stripes, hunched rear posture",
    "image": "Burrowrex.png"
  },
  {
    "id": "136",
    "name": "Starnap",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "0.8",
    "pokedex": "This serene being drifts between constellations, its fur mapping the heavens while it slumbers in eternal peace.",
    "frontKeywords": "soft violet creature, glowing blue eyes, constellation fur patterns, celestial body",
    "backKeywords": "sitting still, peaceful expression, back shows star glyphs, tail tucked",
    "image": "Starnap.png"
  },
  {
    "id": "137",
    "name": "Runelyft",
    "oldName": "Noctiflit",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "Said to be the lost spirit of ancient scholars, it glides silently under starlit skies inscribing runes with each flap.",
    "frontKeywords": "ghostly bat, rune wings, glowing eye, hooded specter",
    "backKeywords": "star sigils, smoky trail, ethereal tail, dark wingspan",
    "image": "Runelyft.png"
  },
  {
    "id": "138",
    "name": "Ashcat",
    "oldName": "Noctikitten",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "0.8",
    "pokedex": "Born from soot and shadow, Ashcat is a mischievous feline spirit that slinks between realms at dusk. It exudes a mysterious charm with its ember eyes and trailing wisps that swirl like smoke when it moves. Despite its spooky presence, it often guides lost travelers to safety.",
    "frontKeywords": "black cat spirit, red eyes, shadowy tendrils, mischievous expression, small stature, feline form, dark fur, ghostly theme, elemental creature",
    "backKeywords": "shadowy tail tendrils, small round ears, glowing red eyes not visible, smooth back fur, curled smoky silhouette, feline back pose",
    "image": "Ashcat.png"
  },
  {
    "id": "139",
    "name": "Inkryft",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "foulplay,covet,swift,",
    "size": "1",
    "pokedex": "A mysterious creature of shadow and silence, Inkryft is rarely seen in light. Some say it harbors forgotten dreams.",
    "frontKeywords": "shadow creature, wide eyes, wavy mane, soft silhouette",
    "backKeywords": "blacked-out tail, spiked back fur, sleek profile",
    "image": "Inkryft.png"
  },
  {
    "id": "140",
    "name": "Terracub",
    "oldName": "Volcubby",
    "types": "Ground",
    "evolutions": [
      [
        "Magmabear",
        "Item",
        "Firestone"
      ]
    ],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "It burrows deep beneath the forest floor, its drill-like claws and earthy scent revealing its subterranean origin.",
    "frontKeywords": "brown bear cub, drill paws, dirt-covered back, wide orange eyes",
    "backKeywords": "sitting position, claws forward, earthy fur, stubby tail",
    "image": "Terracub.png"
  },
  {
    "id": "141",
    "name": "Magmabear",
    "oldName": "Magmaur",
    "types": "Ground,Fire",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "0.9",
    "pokedex": "Born from the heart of a volcano, this beast stomps molten trails into the earth as it prowls.",
    "frontKeywords": "volcanic bear, lava claws, glowing eyes, eruption on back",
    "backKeywords": "lava dripping back, smoldering volcano, molten fur, sharp claws",
    "image": "Magmabear.png"
  },
  {
    "id": "142",
    "name": "Foggin",
    "oldName": "",
    "types": "Ice,Dark",
    "evolutions": [
      [
        "Cerberuff",
        "Level",
        "39"
      ]
    ],
    "moves": "sweetkiss,lick,pound,powdersnow",
    "size": "1.1",
    "pokedex": "Foggin is a spectral pup formed of forest mist. It appears silently at twilight to guide lost travelers home.",
    "frontKeywords": "misty wolf, glowing eyes, fog mane, blue fur, calm posture, spirit dog",
    "backKeywords": "fog trail, cloud-like back, translucent form, ethereal outline, cool blue palette",
    "image": "Foggin.png"
  },
  {
    "id": "143",
    "name": "Cerberuff",
    "oldName": "Baskervapour",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1.2",
    "pokedex": "Cerberuff is a three-headed guardian dog born from shadows. Each head has its own bark, but they all agree on protecting the gates of the underworld.",
    "frontKeywords": "black three-headed dog, red glowing eyes, snarling mouths, smoke cloud, demonic aura, mythic guardian, aggressive posture",
    "backKeywords": "three necks from behind, dense black fur, smoke trail, hunched rear legs, muscular canine back, red glow reflection",
    "image": "Cerberuff.png"
  },
  {
    "id": "144",
    "name": "Aethermech",
    "oldName": "",
    "types": "Electric",
    "evolutions": [],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "1",
    "pokedex": "Aethermech is a forgotten relic of the skies, forged by ancient hands and powered by divine lightning. With wings of gold and conduits crackling with energy, it serves as both guardian and guide through celestial storms, bound to protect sacred domains from intruders.",
    "frontKeywords": "mechanical angel, gold wings, glowing blue eyes, electric aura, floating construct, bronze plating, ancient tech, circular energy rings, divine relic, magical automaton",
    "backKeywords": "winged helm, circuits glowing from behind, exposed mechanical joints, bronze and gold armor, back-mounted conduits, hovering stance, rear rings visible",
    "image": "Aethermech.png"
  },
  {
    "id": "145",
    "name": "Quokkus",
    "oldName": "Floramoss",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.9",
    "pokedex": "This cheerful creature is a nature mage in training. Its staff sprouts leaves with every spell, and its robe is embroidered with ancient glyphs.",
    "frontKeywords": "quokka wizard, leafy robe, glowing staff, cartoon mage, flower crown, swirl patterns",
    "backKeywords": "robed forest creature back view, floral cape, staff raised, leafy hood",
    "image": "Quokkus.png"
  },
  {
    "id": "146",
    "name": "Shadebandit",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "A clever lurker of shadowy woods, its glowing rings signal an ambush is near—but it’s long gone by the time you notice.",
    "frontKeywords": "black fox, glowing tail rings, sharp eyes, night hunter",
    "backKeywords": "arched back, stealthy step, tail lifted, dark fur glow",
    "image": "Shadebandit.png"
  },
  {
    "id": "147",
    "name": "Glitternut",
    "oldName": "Moonspire",
    "types": "Fairy,Ground",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "0.8",
    "pokedex": "With a shimmering tail that sparkles like the stars, this cheerful squirrel is known to stash rare magical nuts.",
    "frontKeywords": "cute squirrel, glitter tail, soft fur, bright eyes",
    "backKeywords": "shimmering tail fluff, upright stance, pastel gradient",
    "image": "Glitternut.png"
  },
  {
    "id": "148",
    "name": "Serplash",
    "oldName": "Buoyantor",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "Often seen weaving through reeds, this shy serpent mimics floating lilies to avoid detection.",
    "frontKeywords": "aquatic serpent, blue fins, lily mimic tail, peaceful eyes",
    "backKeywords": "coiled tail, dorsal fins, spotted texture, low-swim stance",
    "image": "Serplash.png"
  },
  {
    "id": "149",
    "name": "Purradox",
    "oldName": "Abylux",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "This enigmatic feline is born during solar eclipses. Its runes shimmer under moonlight, and its wings carry it silently through shadows and dreams.",
    "frontKeywords": "sleek black cat, glowing cyan runes, bat-like wings, piercing eyes, arcane feline",
    "backKeywords": "back-facing mystical cat, wing spread, tail swirls, glowing markings",
    "image": "Purradox.png"
  },
  {
    "id": "150",
    "name": "Wattquill",
    "oldName": "",
    "types": "Electric,Ground",
    "evolutions": [],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "0.8",
    "pokedex": "A gentle porcupine whose spines surge with electricity when threatened—quiet but not to be underestimated.",
    "frontKeywords": "golden porcupine, blue electric spines, cute eyes, sitting calmly",
    "backKeywords": "fanned spines, calm face, static flickers, paws close together",
    "image": "Wattquill.png"
  },
  {
    "id": "151",
    "name": "Corseal",
    "oldName": "Squorala",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "Corseal is a cheerful sea creature that camouflages as coral reefs. It bobs through tides, lighting up shallow lagoons with its vibrant charm.",
    "frontKeywords": "blue seal, coral antlers, orange fins, soft belly, aquatic creature, smiling face, gentle marine glow",
    "backKeywords": "coral branches from above, wide fin tail, round back, orange spots trail, sleek aquatic body",
    "image": "Corseal.png"
  },
  {
    "id": "152",
    "name": "Florabun",
    "oldName": "Petalune",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Florabun is a gentle woodland sprite that nurtures blooming meadows. Its thistle crown marks it as a guardian of flora.",
    "frontKeywords": "green rabbit, thistle head, leaf fur, big eyes, soft mane, nature creature",
    "backKeywords": "leafy spine, fluffy green tail, petal tufts, small paws, thistle bloom from above",
    "image": "Florabun.png"
  },
  {
    "id": "153",
    "name": "Ashplume",
    "oldName": "Ignaviary",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Ashplume is a regal phoenix of the volcanic isles, reborn through flame and fury. Its fiery crest blazes like the dawn, and its magnificent peacock-like tail glows with ember patterns. When it cries, the wind carries the sound of distant thunder and forgotten flames.",
    "frontKeywords": "fiery bird, red-orange feathers, peacock tail, glowing eyes, fierce gaze, mythical phoenix, standing posture, elegant wings, fire element",
    "backKeywords": "broad tail feathers with glowing patterns, bright crest plume visible from back, wings partially folded, flame-licked edges, feather layering, upright posture",
    "image": "Ashplume.png"
  },
  {
    "id": "154",
    "name": "Moorspite",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "Shrouded in moss and malice, Moorspite is a vengeful spirit of the bog, haunting those who dare disturb the balance of the wild.",
    "frontKeywords": "dark green beast, glowing green eyes, mossy fur, antlers, spooky creature, swamp monster",
    "backKeywords": "mossy back, shaggy fur, eerie antlers, dark form walking away, ghostly aura",
    "image": "Moorspite.png"
  },
  {
    "id": "155",
    "name": "Glimmoth",
    "oldName": "",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "0.8",
    "pokedex": "This mystical dragonfly-like creature flits silently through moonlit groves, leaving trails of glowing wind behind it.",
    "frontKeywords": "blue moth dragon, glowing eyes, wispy wings, magical aura",
    "backKeywords": "fluttering wings, slim body, glow effects, airy motion",
    "image": "Glimmoth.png"
  },
  {
    "id": "156",
    "name": "Bristlebark",
    "oldName": "",
    "types": "Grass,Ground",
    "evolutions": [],
    "moves": "earthquake,woodhammer,tackle,withdraw",
    "size": "1.2",
    "pokedex": "Bristlebark is a lumbering forest guardian covered in mossy fur and tree bark. Its antlers and thorny back bristle with warning, and its roar is like wind through the canopy.",
    "frontKeywords": "green beast, wooden antlers, bark-textured fur, spiked back, forest creature, snarling face, heavy paws, floral accents",
    "backKeywords": "branch antlers from behind, mossy back spikes, thick trunk-like limbs, forest green texture, overgrown leaf patches",
    "image": "Bristlebark.png"
  },
  {
    "id": "157",
    "name": "Bowdrake",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "Bowdrake is a rare leafy dragon adorned with a ceremonial bow. It lives in enchanted glades and protects forest paths from those with ill intent. Despite its elegant ribbon, it’s a formidable foe when provoked.",
    "frontKeywords": "green dragon, pink bow, small wings, leafy back, cute protector, noble expression, spotted belly, tiny horns, magical creature",
    "backKeywords": "bow tied behind neck, small dark wings, leaf spine visible, long curling tail, patterned back, draconic silhouette",
    "image": "Bowdrake.png"
  },
  {
    "id": "158",
    "name": "Beedazzle",
    "oldName": "Gemilum",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "0.8",
    "pokedex": "Beedazzle is a radiant larval creature adorned with dazzling crystals. It crawls slowly through flower fields, spreading pollen-like glitter wherever it goes. Each gem on its back contains stored sunlight to help nearby plants bloom.",
    "frontKeywords": "crystal caterpillar, pastel gems, yellow body, happy face, gem wings, soft glow, insect baby form, sparkling design, elemental bug",
    "backKeywords": "large rainbow crystals, stubby legs, pastel reflections, back-heavy posture, gemstone spread, soft insect curves",
    "image": "Beedazzle.png"
  },
  {
    "id": "159",
    "name": "Zaptail",
    "oldName": "",
    "types": "Normal,Electric",
    "evolutions": [],
    "moves": "tackle,sandattack,gust,quickattack",
    "size": "1",
    "pokedex": "This lightning-charged feline crackles with power, darting faster than sight on stormy nights.",
    "frontKeywords": "electric porcupine, glowing quills, golden fur, blue streaks",
    "backKeywords": "static sparks, quills bristling, tail curled forward, energetic look",
    "image": "Zaptail.png"
  },
  {
    "id": "160",
    "name": "Scaldrake",
    "oldName": "",
    "types": "Ground,Fire",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "Covered in molten scales, this fierce little dragon is a relentless guardian of volcanic caverns.",
    "frontKeywords": "black-scaled dragon, fierce gaze, armored plates, sharp claws",
    "backKeywords": "tail curled, heavy tail scales, armored back, stance alert",
    "image": "Scaldrake.png"
  },
  {
    "id": "161",
    "name": "Glacibex",
    "oldName": "",
    "types": "Ice",
    "evolutions": [],
    "moves": "powdersnow,astonish,leer,doubleteam",
    "size": "1.2",
    "pokedex": "Living atop the coldest peaks, Glacibex is a hardy mountain goat with crystal formations in its fur. Its breath can summon a freezing fog.",
    "frontKeywords": "icy goat, crystal spines, curved horns, thick winter coat",
    "backKeywords": "shaggy back, blue crystal ridges, frost-dusted tail",
    "image": "Glacibex.png"
  },
  {
    "id": "162",
    "name": "Emberine",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "0.8",
    "pokedex": "This playful fox radiates a gentle heat from its flame-like fur. Emberine is often found frolicking in warm glades, where it stirs embers with its joyful energy and spreads light wherever it goes.",
    "frontKeywords": "small fox, yellow and orange fur, star marking, big eyes, warm glow, sitting pose, flame-like ears and tail, pink cheeks, friendly",
    "backKeywords": "swirling flame tail, back fluff, pointed ears, star-shaped marking, curled seated posture, soft gradient coloring",
    "image": "Emberine.png"
  },
  {
    "id": "163",
    "name": "Bubbliss",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "0.8",
    "pokedex": "Bubbliss is a playful water spirit that bounces over waves with glee. Its jelly body glows in moonlight, and it brings calm to any who touch its shimmering surface.",
    "frontKeywords": "blue bubble creature, happy face, glowing cheeks, jelly body, small fins, watery tail, floating pose, water sprite",
    "backKeywords": "smooth blue back, light trail droplets, fin ripples, bubbly tail, rounded water shape, glossy texture",
    "image": "Bubbliss.png"
  },
  {
    "id": "164",
    "name": "Buffawn",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1.1",
    "pokedex": "Buffawn is a cheerful plains-dweller known for its joyful gallops and hearty laugh. It often races the wind across open fields, bringing good luck to those it passes.",
    "frontKeywords": "brown bison calf, large horns, fluffy mane, joyful expression, cartoon hooves, running pose, prairie creature, laughing mouth",
    "backKeywords": "curly back fur, short tufted tail, horn arcs from behind, rear leg motion, broad shoulder fluff",
    "image": "Buffawn.png"
  },
  {
    "id": "165",
    "name": "Faewyn",
    "oldName": "Aurelix",
    "types": "Fairy",
    "evolutions": [],
    "moves": "sing,sweetkiss,disarmingvoice,encore",
    "size": "1.1",
    "pokedex": "A guardian of moonlit forests, Faewyn flutters between realms with grace. Its wings shimmer like morning dew on leaves, and its presence soothes even the fiercest foes.",
    "frontKeywords": "fae deer, butterfly wings, blue tones, glowing eyes, elegant, antlers, pastel feathers, magical creature, graceful stance, ethereal",
    "backKeywords": "wide wingspan, delicate wing pattern, light blue back, small hooves, ethereal glow, layered feathers",
    "image": "Faewyn.png"
  },
  {
    "id": "166",
    "name": "Fungalux",
    "oldName": "",
    "types": "Water,Dark",
    "evolutions": [],
    "moves": "aquajet,leer,poisonfang,focusenergy",
    "size": "1",
    "pokedex": "This jelly-like being floats through dark forests, glowing with bioluminescence. The mushrooms growing on its body feed on the stars it absorbs.",
    "frontKeywords": "mushroom jellyfish, night sky pattern, glowing blue, star markings",
    "backKeywords": "mushroom cap dome, pulsing spores, luminous jelly tentacles",
    "image": "Fungalux.png"
  },
  {
    "id": "167",
    "name": "Mechalupine",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "chargebeam,metalclaw,bulldoze,ancientpower",
    "size": "1",
    "pokedex": "A sentinel forged from brass and obsidian, Mechalupine prowls forgotten ruins with a growl like grinding gears. Legends say it guards the secrets of the ancients.",
    "frontKeywords": "mechanical wolf, black fur, brass armor, glowing red eyes, steampunk, metal limbs, aggressive stance",
    "backKeywords": "mechanical back, armored spine, tail plates, brass joints, dark silhouette from rear",
    "image": "Mechalupine.png"
  },
  {
    "id": "168",
    "name": "Kelpup",
    "oldName": "",
    "types": "Water,Grass",
    "evolutions": [],
    "moves": "astonish,growl,absorb,watergun",
    "size": "1",
    "pokedex": "Playful and agile, Kelpup glides through underwater forests, nibbling on coral and tickling passing fish with its leafy fur.",
    "frontKeywords": "aquatic otter, leaf fins, bubbly expression, sleek fur",
    "backKeywords": "flowing tail, kelp mane, webbed feet",
    "image": "Kelpup.png"
  },
  {
    "id": "169",
    "name": "Petalight",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "A guardian of blossom groves, it glows faintly at dusk and summons light with its fluttering wings.",
    "frontKeywords": "butterfly mouse, green fur, leafy wings, lotus blossom",
    "backKeywords": "wing glow, small paws, soft hues, hovering stance",
    "image": "Petalight.png"
  },
  {
    "id": "170",
    "name": "Buttermew",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "1",
    "pokedex": "Buttermew is a sweet-natured critter with wings of syrup and a pat of magical butter atop its head. Its warm scent draws both friends and foes alike.",
    "frontKeywords": "butter-topped creature, golden wings, chubby body, cartoon style, orange fur, round face, whimsical, joyful vibe",
    "backKeywords": "wing tips curved back, butter square on head, fluffy tail, smooth back curves, cozy yellow tones",
    "image": "Buttermew.png"
  },
  {
    "id": "171",
    "name": "Swanareign",
    "oldName": "",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1",
    "pokedex": "This elegant monarch of the lakes exudes grace and wisdom, ruling with a calm dignity from her crystal waters.",
    "frontKeywords": "white swan queen, ice-blue feathers, jeweled gold crown and collar, regal eyes",
    "backKeywords": "wings open in greeting, neck arched, shimmering plumage, crown gleam",
    "image": "Swanareign.png"
  },
  {
    "id": "172",
    "name": "Flotter",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "0.8",
    "pokedex": "Flotter is an otter-like swimmer who crafts river tools from shells. Its necklace rings clink as it dashes through streams.",
    "frontKeywords": "otter creature, red fur, white underbelly, shell necklace, curious face, playful look",
    "backKeywords": "smooth tail, sleek fur pattern, necklace shell backs, brown paws, agile shape",
    "image": "Flotter.png"
  },
  {
    "id": "173",
    "name": "Coinnip",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Pyrek",
        "Level",
        "24"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.9",
    "pokedex": "Coinnip is a sneaky fox who hoards gold in hidden pouches. With every snicker, it plots its next heist, always a step ahead of the greedy.",
    "frontKeywords": "gold thief fox, smug face, coin in paw, brown fur, sneaky grin, sack bundles, trickster, agile stance",
    "backKeywords": "tail raised high, pouch straps visible, ears perked from behind, coin shimmer reflection, quick pose form",
    "image": "Coinnip.png"
  },
  {
    "id": "174",
    "name": "Pyrek",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Pyrek’s cackling howl foretells wildfires. It lives in volcanic plains and builds dens of obsidian and bone.",
    "frontKeywords": "feral hyena creature, fiery fur, blue glowing eyes, jagged smile, flame patterns",
    "backKeywords": "wild canine back view, ember tail, electric stripes, spiked back fur",
    "image": "Pyrek.png"
  },
  {
    "id": "175",
    "name": "Lilypadle",
    "oldName": "",
    "types": "Grass",
    "evolutions": [
      [
        "Lilybell",
        "Level",
        "25"
      ]
    ],
    "moves": "absorb,bind,stunspore,growth",
    "size": "0.8",
    "pokedex": "This sprout-like creature hides in ponds and chirps musically in the rain.",
    "frontKeywords": "round green creature, lily-of-the-valley plant, soft smile, dotted pattern",
    "backKeywords": "leafy back, small flower bulbs, seated pose, gentle tones",
    "image": "Lilypadle.png"
  },
  {
    "id": "176",
    "name": "Lilybell",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "This forest sprite is known to chime gently as it walks, bringing luck and blooming flora in its wake.",
    "frontKeywords": "leafy humanoid, lily of the valley buds, wide eyes, nature spirit",
    "backKeywords": "leafy cloak from behind, flower stalks, small barefoot steps",
    "image": "Lilybell.png"
  },
  {
    "id": "177",
    "name": "Halumo",
    "oldName": "",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "0.8",
    "pokedex": "Said to embody purity, Halumo floats through the skies, guiding lost souls gently to rest with its angelic glow.",
    "frontKeywords": "angel cloud, halo, soft wings, cute eyes",
    "backKeywords": "cloudy back, halo from behind, light wings, floating",
    "image": "Halumo.png"
  },
  {
    "id": "178",
    "name": "Abyeye",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "Abyeye is a solitary creature of the deep, a living abyssal sentinel. Its single, hypnotic eye sees through lies and into the soul of its prey. Legends say it drifts silently across the ocean floor, feeding on fear and forgotten memories, its spiked body absorbing all that comes too close.",
    "frontKeywords": "black spiked orb, single large eye, eerie gaze, sea urchin shape, deep sea creature, floating, horror-inspired, symmetrical design, dark palette, mystical entity",
    "backKeywords": "spikes radiating outward, no visible eye, central dark core, orb silhouette, slightly glossy back surface, spiny texture, hollow center illusion",
    "image": "Abyeye.png"
  },
  {
    "id": "179",
    "name": "Cuboulder",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1",
    "pokedex": "Cuboulder is a grumpy forest sentinel with a mossy shell. It carries ancient wisdom in silence and won’t move unless absolutely necessary.",
    "frontKeywords": "rock turtle bear, mossy stone shell, spiral symbol, angry expression, heavy limbs, earthy tones, grounded creature",
    "backKeywords": "craggy stone shell, moss patches, squat hind legs, back spiral glow, stone segments visible",
    "image": "Cuboulder.png"
  },
  {
    "id": "180",
    "name": "Geobruin",
    "oldName": "",
    "types": "Ground",
    "evolutions": [],
    "moves": "scratch,defensecurl,poisonsting,sandattack",
    "size": "1.2",
    "pokedex": "Fierce and silent, Geobruin carries a stone shell that once served as part of an ancient ruin. It moves with weight and purpose.",
    "frontKeywords": "stone bear tortoise, mossy armor, glowing glyph shell, amber eyes",
    "backKeywords": "sloped shell plates, muscular hind legs, cracked stone texture",
    "image": "Geobruin.png"
  },
  {
    "id": "181",
    "name": "Auravelle",
    "oldName": "",
    "types": "Mythic",
    "evolutions": [],
    "moves": "wrap,leer,twister,thunderwave",
    "size": "1",
    "pokedex": "A unicorn born under starlight, Auravelle glows with celestial grace. Her flowing golden mane shimmers like sunlight on dew, and she dances effortlessly between the clouds. Believed to bring peace to any land she walks, her presence marks a blessed era.",
    "frontKeywords": "white pegasus unicorn, golden mane, gentle expression, hooved feet, elegant stance, mythical creature, light aura, soft curves, divine mount",
    "backKeywords": "flowing mane trailing behind, white wings folded back, tail curled gracefully, golden hooves visible, back legs in proud stance, bright fur texture",
    "image": "Auravelle.png"
  },
  {
    "id": "182",
    "name": "Perclamp",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "This reclusive critter hides under its shell, revealing its gleaming eyes only when the coast is clear.",
    "frontKeywords": "clam shell, black body, yellow star eyes, cautious face",
    "backKeywords": "back shell dome, glossy pink, tucked feet, flat base",
    "image": "Perclamp.png"
  },
  {
    "id": "183",
    "name": "Forgron",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1.1",
    "pokedex": "Forged in ancient mountain furnaces, Forgron’s metal body is powered by steam pressure and molten energy. It tirelessly hammers glowing ores into mysterious shapes.",
    "frontKeywords": "armored cyclops golem, fire hammer, smoke vents, single eye, furnace-powered",
    "backKeywords": "thick metal limbs, chained flame tail, rear vents emitting steam",
    "image": "Forgron.png"
  },
  {
    "id": "184",
    "name": "Webloom",
    "oldName": "",
    "types": "Normal,Fairy",
    "evolutions": [],
    "moves": "sweetkiss,disarmingvoice,disable,charm",
    "size": "0.8",
    "pokedex": "A fluffy crawler that nests in cherry trees, weaving silk hammocks from its own floral fuzz.",
    "frontKeywords": "pink fuzzy spider, sakura petals, big eyes, cute floral design",
    "backKeywords": "round body, shy expression, petals blooming, soft texture",
    "image": "Webloom.png"
  },
  {
    "id": "185",
    "name": "Shifu",
    "oldName": "Pandloom",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "Despite its small stature, this red panda possesses the soul of a warrior and trains daily to protect its forest.",
    "frontKeywords": "cute red panda, large eyes, striped tail, round head, sitting pose",
    "backKeywords": "fluffy tail, hunched posture, forest guardian, animal cub, red fur",
    "image": "Shifu.png"
  },
  {
    "id": "186",
    "name": "Circuitail",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "chargebeam,metalclaw,bulldoze,ancientpower",
    "size": "0.8",
    "pokedex": "Circuitail is a high-tech rodent built from neon circuitry. It scampers along data cables and disrupts signals with its pulsing tail and round antennae.",
    "frontKeywords": "cyber mouse, black suit, neon blue lights, large ears, tech lines, glowing visor, digital tail, sci-fi creature",
    "backKeywords": "glowing line down back, tail cord stretch, circuit pattern on rear, disc ears from behind, smooth black silhouette",
    "image": "Circuitail.png"
  },
  {
    "id": "187",
    "name": "Tidroak",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "0.8",
    "pokedex": "A playful sea whelp that dances in currents, its bubble breaths signal an oncoming downpour to sailors.",
    "frontKeywords": "dark blue seahorse dragon, light wings, bubble breath, ocean dweller",
    "backKeywords": "hovering upright, curled tail, water droplets, side fins spread",
    "image": "Tidroak.png"
  },
  {
    "id": "188",
    "name": "Gleamira",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.9",
    "pokedex": "An elusive forest dweller whose jewel-like fur patterns shimmer under moonlight, said to bring luck to those who spot it.",
    "frontKeywords": "graceful ferret, red gems, elegant stance, wide eyes",
    "backKeywords": "bushy tail, sleek back, gem-patterned fur, arched posture",
    "image": "Gleamira.png"
  },
  {
    "id": "189",
    "name": "Frosthorn",
    "oldName": "",
    "types": "Ice",
    "evolutions": [],
    "moves": "powdersnow,astonish,leer,doubleteam",
    "size": "1.2",
    "pokedex": "A regal and elusive creature, Frosthorn roams the icy highlands. Its antlers shimmer with frost, and its cold gaze can freeze threats in their tracks.",
    "frontKeywords": "ice stag, crystalline tail, elegant white coat, piercing blue eyes",
    "backKeywords": "multiple icy antlers, fluffed winter coat, glacial-patterned tail",
    "image": "Frosthorn.png"
  },
  {
    "id": "190",
    "name": "Clamora",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1",
    "pokedex": "Clamora is a royal mollusk whose pearls hum with ancient songs. It dances atop waves and shelters secrets in its petal crown.",
    "frontKeywords": "pearl sea creature, pink shell, white pearls, blue eyes, royal headdress, calm face, aquatic jewelry",
    "backKeywords": "layered pearl rings, clam shell folds, rear crown detail, circular back body, pink petal texture",
    "image": "Clamora.png"
  },
  {
    "id": "191",
    "name": "Chargnode",
    "oldName": "",
    "types": "Electric",
    "evolutions": [],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "1",
    "pokedex": "Chargnode is a power-packed crawler used to ignite old generators and defend power plants. Its lightning bolt antenna surges with electric pulses.",
    "frontKeywords": "metallic quadruped, lightning bolt head, black and white shell, gold trim, angry expression, tech-creature, electric-type",
    "backKeywords": "cable tail, dome-shaped shell, back-mounted coil, robotic limbs, antenna arcs backward, shock markings",
    "image": "Chargnode.png"
  },
  {
    "id": "192",
    "name": "Smoketail",
    "oldName": "",
    "types": "Electric",
    "evolutions": [],
    "moves": "thundershock,tackle,supersonic,thunderwave",
    "size": "0.9",
    "pokedex": "Fueled by sparks and steam, this monkey is a crafty inventor known for building explosive gadgets.",
    "frontKeywords": "steampunk monkey, goggles, spark tail, brown fur, brass harness",
    "backKeywords": "smoke trail, gear backpack, mechanical tail, crouched pose, steamy effect",
    "image": "Smoketail.png"
  },
  {
    "id": "193",
    "name": "Eldrun",
    "oldName": "",
    "types": "Ground,Dark",
    "evolutions": [
      [
        "Wraithusk",
        "Level",
        "23"
      ]
    ],
    "moves": "powertrip,leer,sandattack,honeclaws",
    "size": "1",
    "pokedex": "Wreathed in tribal mystery, Eldrun is a nomadic guardian believed to protect ancient ruins. Its skeletal mask and runic markings tell of countless battles fought and wisdom passed from elder to elder.",
    "frontKeywords": "spirit deer, skeletal mask, braids, tribal patterns, dark fur, glowing red eyes, ancient markings, long tail, hoofed legs, protector",
    "backKeywords": "braided hair, spiral mark on side, back of skull mask, long flowing tail, slender back legs, shadowy silhouette",
    "image": "Eldrun.png"
  },
  {
    "id": "194",
    "name": "Wraithusk",
    "oldName": "",
    "types": "Ground,Dark",
    "evolutions": [
      [
        "Scaraknight",
        "Level",
        "36"
      ]
    ],
    "moves": "powertrip,leer,sandattack,honeclaws",
    "size": "1",
    "pokedex": "Shrouded in ancient curses, it stalks the earth wearing bones of its prey like armor.",
    "frontKeywords": "bone mask, skeletal claws, fang tusks, mummy wrappings",
    "backKeywords": "crouched position, extended claws, shadowy pelt, red-stained tusks",
    "image": "Wraithusk.png"
  },
  {
    "id": "195",
    "name": "Scaraknight",
    "oldName": "",
    "types": "Water,Dark",
    "evolutions": [],
    "moves": "aquajet,leer,poisonfang,focusenergy",
    "size": "1.1",
    "pokedex": "From the swamp's depths it rises—part guardian, part phantom—wearing bark and bone as armor.",
    "frontKeywords": "skeletal swamp beast, moss-covered shell, wooden claws, eerie eyes",
    "backKeywords": "vine limbs, mossy back, broken skull mask, hunched posture",
    "image": "Scaraknight.png"
  },
  {
    "id": "196",
    "name": "Crooklet",
    "oldName": "",
    "types": "Water",
    "evolutions": [
      [
        "Crocclaw",
        "Level",
        "24"
      ]
    ],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "0.8",
    "pokedex": "Crooklet is a curious hatchling who thinks the world is a game. It bites playfully and often tumbles through its own steps.",
    "frontKeywords": "baby croc, wide eyes, green back ridges, round snout, orange body, cute pose, early evolution",
    "backKeywords": "green scale ridges, stubby tail, rounded back, back feet peeking out, waddling posture",
    "image": "Crooklet.png"
  },
  {
    "id": "197",
    "name": "Crocclaw",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1.2",
    "pokedex": "Crocclaw is a fierce reptilian brawler that dominates swamp arenas. With heavy fists and a tail smash, it crushes all challengers.",
    "frontKeywords": "orange crocodile, green spikes, sharp claws, combat stance, thick tail, belly armor, aggressive expression",
    "backKeywords": "green back spikes, large curved tail, clawed arms behind, wide back plates, brawler shoulders",
    "image": "Crocclaw.png"
  },
  {
    "id": "198",
    "name": "Sparmlet",
    "oldName": "",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "This curious hamster crackles with static energy, using the patterns on its fur to store and release controlled electric bursts.",
    "frontKeywords": "round hamster, orange-and-white fur, electric markings, upright stance, tiny paws",
    "backKeywords": "spark-patterned back, curled tail, whiskers twitching, alert posture",
    "image": "Sparmlet.png"
  },
  {
    "id": "199",
    "name": "Chimeraze",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Chimeraze is a spectral jelly that jingle-dances through haunted halls. Its bells summon faded memories and lost spirits that shimmer like music.",
    "frontKeywords": "red ghost blob, golden bells, floating arms, glowing eyes, haunted face, spooky cheerful, sound-based ghost",
    "backKeywords": "bell arms extended, smooth cloak shape, top bell visible from above, back flare hem, floaty body tilt",
    "image": "Chimeraze.png"
  },
  {
    "id": "200",
    "name": "Lunalup",
    "oldName": "",
    "types": "Normal",
    "evolutions": [
      [
        "Cryowarden",
        "Level",
        "31"
      ]
    ],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "Mystical and elusive, this moon-marked pup howls under starlit skies to guide travelers.",
    "frontKeywords": "gray wolf pup, red gemstone necklace, white-tipped fur, alert eyes",
    "backKeywords": "curled tail, gemstone back, fluffy fur, upright ears",
    "image": "Lunalup.png"
  },
  {
    "id": "201",
    "name": "Cryowarden",
    "oldName": "",
    "types": "Ice",
    "evolutions": [],
    "moves": "powdersnow,astonish,leer,doubleteam",
    "size": "1.1",
    "pokedex": "Cryowarden is a lone alpha of frozen tundras, prowling beneath northern lights. Its howl summons blizzards and chills hearts.",
    "frontKeywords": "frost wolf, glowing cyan markings, white mane, dark fur, icy gaze, thick tail, elemental guardian",
    "backKeywords": "diamond patches on back, fluffy tail curled, shoulder fur tufts, ice shard glints, lean snowy figure",
    "image": "Cryowarden.png"
  },
  {
    "id": "202",
    "name": "Knotshade",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1.1",
    "pokedex": "This enigmatic guardian is woven from ancient roots and bark. Its glowing chest holds the spirit of the forest.",
    "frontKeywords": "wood beast, faceless, vine limbs, glowing core",
    "backKeywords": "knotty texture, tail root, curved back legs",
    "image": "Knotshade.png"
  },
  {
    "id": "203",
    "name": "Vireldrake",
    "oldName": "",
    "types": "Water",
    "evolutions": [],
    "moves": "tackle,tailwhip,watergun,withdraw",
    "size": "1.2",
    "pokedex": "An ancient serpent said to swim through winds like waves—its iridescent scales shimmer like glass.",
    "frontKeywords": "long feathered dragon, layered sapphire scales, sharp snout, ethereal",
    "backKeywords": "coiled S-shape, open mouth, floating midair, wind ripple effects",
    "image": "Vireldrake.png"
  },
  {
    "id": "204",
    "name": "Brambarric",
    "oldName": "",
    "types": "Ground,Electric",
    "evolutions": [],
    "moves": "mudslap,tackle,watergun,thundershock",
    "size": "1.2",
    "pokedex": "Brambarric is a desert beast whose back is covered in electrified cactus growths. It channels sandstorms through its spines and moves with thundering weight, its steps cracking the dry earth.",
    "frontKeywords": "cactus beast, tan striped body, green cactus on back, armored limbs, desert creature, grounded pose, electric thorns, savage stance",
    "backKeywords": "spiny cactus ridge, striped tail, wide shoulders, earthen textures, desert pattern back, lightning marks",
    "image": "Brambarric.png"
  },
  {
    "id": "205",
    "name": "Arachne",
    "oldName": "Webmourne",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "This cursed creature weaves webs of fate and sorrow in the darkest corners of the world. Arachne’s shadowy cloak conceals her spider limbs and the haunting skull she wears as a brooch. Those who see her rarely escape her labyrinth of threads and illusions.",
    "frontKeywords": "dark spider cloak, skull ornament, shadowy veil, glowing blue eyes, gothic creature, web spinner, cloak-covered limbs, draped design, eerie elegance",
    "backKeywords": "hooded back, black widow silhouette, multiple legs emerging below, textured spider cape, skull not visible, flowing fabric, pointed limb angles",
    "image": "Arachne.png"
  },
  {
    "id": "206",
    "name": "Patchy",
    "oldName": "Stitcheek",
    "types": "Normal",
    "evolutions": [],
    "moves": "tackle,tailwhip,quickattack,focusenergy",
    "size": "0.8",
    "pokedex": "Once a forgotten toy, it came to life with stitched magic and now roams to bring joy—or mischief.",
    "frontKeywords": "plush cat, button eyes, wide grin, stitched smile, flower neck",
    "backKeywords": "mismatched limbs, thread details, cheerful pose, pastel colors",
    "image": "Patchy.png"
  },
  {
    "id": "207",
    "name": "Boomlet",
    "oldName": "",
    "types": "Electric",
    "evolutions": [],
    "moves": "playnice,sweetkiss,nuzzle,nastyplot",
    "size": "0.7",
    "pokedex": "Boomlet is a tiny but volatile rodent with an explosive tail. It’s quick to dart and quicker to spark, leaving trails of fizzing light in its wake. Though small, it’s a favorite companion of demolition crews.",
    "frontKeywords": "mouse bomb, dark fur, fuse tail, tiny paws, rounded ears, orange eyes, cautious stance, volatile creature, spark element",
    "backKeywords": "fuse glowing at tail tip, small rounded back, upright ears from behind, crouched posture, short limbs, explosive detail",
    "image": "Boomlet.png"
  },
  {
    "id": "208",
    "name": "Phanturn",
    "oldName": "",
    "types": "Dark",
    "evolutions": [],
    "moves": "snarl,foulplay,covet,swift",
    "size": "1",
    "pokedex": "Said to haunt forgotten roads, its lantern head shines in mourning, leading the lost and warning the wicked.",
    "frontKeywords": "ghostly lantern, ribbon arms, glowing eyes, floating body",
    "backKeywords": "smoky tail, faded limbs, metal top, eerie stance",
    "image": "Phanturn.png"
  },
  {
    "id": "209",
    "name": "Charmaw",
    "oldName": "",
    "types": "Fire",
    "evolutions": [],
    "moves": "scratch,growl,ember,smokescreen",
    "size": "1",
    "pokedex": "Charmaw is a volcanic wolf born of molten fury. Its cracked hide glows with magma, and its bite can sear rock. It prowls ash-covered slopes as a fire-forged predator.",
    "frontKeywords": "lava wolf, molten cracks, glowing orange core, black fur, snarling jaws, fire elemental, sharp claws, fierce stance",
    "backKeywords": "cracked molten spine, ember trail, thick black tail, glowing shoulder lines, fiery back veins",
    "image": "Charmaw.png"
  },
  {
    "id": "210",
    "name": "Wiltroot",
    "oldName": "",
    "types": "Grass",
    "evolutions": [],
    "moves": "absorb,bind,stunspore,growth",
    "size": "1",
    "pokedex": "It once thrived in sunlit groves, but now roams shadowed woods, weeping sap and spreading despair with every step.",
    "frontKeywords": "sad sunflower face, withered petals, gnarled root limbs, vine arms",
    "backKeywords": "slouched stance, one flower raised, bark-textured legs, dark yellow-green color",
    "image": "Wiltroot.png"
  },
  {
    "id": "211",
    "name": "Rosgrim",
    "oldName": "",
    "types": "Dark,Grass",
    "evolutions": [],
    "moves": "bind,scratch,leer,vinewhip",
    "size": "1",
    "pokedex": "An eerie beast that blooms under moonlight, its skull-faced flower warns travelers of deep forest curses.",
    "frontKeywords": "dark lion, flower skull face, bramble mane, haunting eyes",
    "backKeywords": "twisted thorns, skeletal neck, petal fringe, shadowed legs",
    "image": "Rosgrim.png"
  }
]